--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 90001, monster_id = 21020201, pos = { x = -53.4, y = 0.8, z = -138.1 }, rot = { x = 0.0, y = 53.9, z = 0.0 }, level = 1, affix = { 1024 }, isElite = true, pose_id = 401 },
	{ config_id = 90002, monster_id = 21010201, pos = { x = -44.9, y = 0.8, z = -135.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 90003, monster_id = 21010201, pos = { x = -49.6, y = 0.8, z = -139.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 90004, monster_id = 21010201, pos = { x = -57.6, y = 0.8, z = -134.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 90005, monster_id = 21010201, pos = { x = -49.9, y = 0.8, z = -133.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 90006, monster_id = 21010201, pos = { x = -44.8, y = 0.8, z = -138.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 90007, gadget_id = 70300099, pos = { x = -48.6, y = 0.8, z = -136.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, state = GadgetState.GearStart }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 90001, 90002, 90003, 90004, 90005, 90006 },
		gadgets = { 90007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
