--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 89001, monster_id = 21020101, pos = { x = 19.4, y = 0.8, z = -150.2 }, rot = { x = 0.0, y = 53.9, z = 0.0 }, level = 1, affix = { 1024 }, isElite = true, pose_id = 401 },
	{ config_id = 89002, monster_id = 21010201, pos = { x = 28.0, y = 0.8, z = -147.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 89003, monster_id = 21010201, pos = { x = 23.3, y = 0.8, z = -151.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 89004, monster_id = 21010201, pos = { x = 15.3, y = 0.8, z = -146.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 89005, monster_id = 21010201, pos = { x = 22.9, y = 0.8, z = -145.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 89006, monster_id = 21010201, pos = { x = 28.0, y = 0.8, z = -150.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 89007, gadget_id = 70300099, pos = { x = 24.2, y = 0.8, z = -148.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, state = GadgetState.GearStart }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 89001, 89002, 89003, 89004, 89005, 89006 },
		gadgets = { 89007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
