--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 88001, monster_id = 22010301, pos = { x = 78.8, y = 0.8, z = -181.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1024 }, isElite = true },
	{ config_id = 88002, monster_id = 21010201, pos = { x = 86.1, y = 0.8, z = -178.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 88003, monster_id = 21010201, pos = { x = 81.4, y = 0.8, z = -183.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 88004, monster_id = 21010201, pos = { x = 73.4, y = 0.8, z = -178.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 88005, monster_id = 21010201, pos = { x = 81.1, y = 0.8, z = -177.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true },
	{ config_id = 88006, monster_id = 21010201, pos = { x = 86.1, y = 0.8, z = -182.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, affix = { 1007, 1008, 1019 }, isElite = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 88007, gadget_id = 70300099, pos = { x = 82.3, y = 0.8, z = -180.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, state = GadgetState.GearStart }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 88001, 88002, 88003, 88004, 88005, 88006 },
		gadgets = { 88007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
