--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 12001, monster_id = 20011201, pos = { x = 453.2, y = -28.5, z = 262.8 }, rot = { x = 0.0, y = 29.8, z = 0.0 }, level = 1, disableWander = true },
	{ config_id = 12002, monster_id = 20011201, pos = { x = 458.0, y = -28.5, z = 262.5 }, rot = { x = 0.0, y = 310.7, z = 0.0 }, level = 1, disableWander = true },
	{ config_id = 12003, monster_id = 20011201, pos = { x = 457.9, y = -28.4, z = 269.0 }, rot = { x = 0.0, y = 240.1, z = 0.0 }, level = 1, disableWander = true },
	{ config_id = 12004, monster_id = 20011201, pos = { x = 453.0, y = -28.4, z = 269.4 }, rot = { x = 0.0, y = 140.0, z = 0.0 }, level = 1, disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = suite_2,
		monsters = { 12001, 12002, 12003, 12004 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
