--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 300001, monster_id = 21010201, pos = { x = 841.5, y = 200.9, z = 172.4 }, rot = { x = 0.0, y = 316.2, z = 0.0 }, level = 17, drop_tag = "丘丘人", pose_id = 9003 },
	{ config_id = 300002, monster_id = 21010401, pos = { x = 838.3, y = 199.5, z = 189.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 17, drop_tag = "远程丘丘人", disableWander = true, pose_id = 9013 },
	{ config_id = 300003, monster_id = 21010401, pos = { x = 840.3, y = 199.5, z = 189.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 17, drop_tag = "远程丘丘人", disableWander = true, pose_id = 9013 },
	{ config_id = 300004, monster_id = 21010201, pos = { x = 838.8, y = 200.9, z = 174.6 }, rot = { x = 0.0, y = 128.9, z = 0.0 }, level = 17, drop_tag = "丘丘人", pose_id = 9003 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 300005, gadget_id = 70310006, pos = { x = 840.2, y = 200.9, z = 173.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 300006, gadget_id = 70220026, pos = { x = 839.3, y = 200.9, z = 170.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 300007, gadget_id = 70220026, pos = { x = 837.7, y = 200.9, z = 171.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 300008, gadget_id = 70211001, pos = { x = 844.3, y = 201.1, z = 171.6 }, rot = { x = 3.0, y = 291.3, z = 2.1 }, level = 17, drop_tag = "战斗低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 300001, 300002, 300003 },
		gadgets = { 300005, 300006, 300007, 300008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
