--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 963, monster_id = 22010201, pos = { x = 2005.1, y = 226.3, z = -692.3 }, rot = { x = 0.0, y = 58.3, z = 0.0 }, level = 1, drop_tag = "深渊法师", affix = { 1401 }, isElite = true },
	{ config_id = 964, monster_id = 21010401, pos = { x = 2011.1, y = 226.8, z = -691.9 }, rot = { x = 0.0, y = 253.2, z = 0.0 }, level = 1, drop_tag = "远程丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 965, monster_id = 21010201, pos = { x = 2010.9, y = 227.2, z = -688.5 }, rot = { x = 0.0, y = 235.5, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 966, monster_id = 21010201, pos = { x = 2007.5, y = 226.9, z = -687.9 }, rot = { x = 0.0, y = 223.4, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 967, monster_id = 21010601, pos = { x = 2008.9, y = 226.2, z = -694.4 }, rot = { x = 0.0, y = 359.9, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 2245, gadget_id = 70300107, pos = { x = 2008.0, y = 226.5, z = -690.8 }, rot = { x = 0.0, y = 323.7, z = 0.0 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 2246, gadget_id = 70220013, pos = { x = 2013.1, y = 226.0, z = -699.4 }, rot = { x = 0.0, y = 71.3, z = 0.0 }, level = 1 },
	{ config_id = 2247, gadget_id = 70220013, pos = { x = 2018.4, y = 226.7, z = -696.8 }, rot = { x = 0.0, y = 329.2, z = 0.0 }, level = 1 },
	{ config_id = 2447, gadget_id = 70220014, pos = { x = 2012.4, y = 226.1, z = -697.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 2448, gadget_id = 70220014, pos = { x = 2013.4, y = 226.3, z = -697.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = suite_1,
		monsters = { 963, 964, 965, 966, 967 },
		gadgets = { 2245, 2246, 2247, 2447, 2448 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
