--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 755, monster_id = 28040101, pos = { x = 2557.0, y = 210.7, z = -1313.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "水族" },
	{ config_id = 756, monster_id = 28040101, pos = { x = 2563.2, y = 210.7, z = -1311.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "水族" },
	{ config_id = 757, monster_id = 28040101, pos = { x = 2565.4, y = 210.7, z = -1312.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "水族" },
	{ config_id = 978, monster_id = 28040101, pos = { x = 2565.3, y = 210.7, z = -1309.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "水族" },
	{ config_id = 979, monster_id = 28040101, pos = { x = 2559.2, y = 210.7, z = -1307.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "水族" },
	{ config_id = 1445, monster_id = 28040101, pos = { x = 2506.7, y = 202.4, z = -1116.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "水族" },
	{ config_id = 1446, monster_id = 28040101, pos = { x = 2506.7, y = 202.4, z = -1116.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "水族" },
	{ config_id = 1447, monster_id = 28040101, pos = { x = 2500.3, y = 202.4, z = -1114.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "水族" },
	{ config_id = 1448, monster_id = 28040101, pos = { x = 2505.1, y = 202.4, z = -1108.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "水族" },
	{ config_id = 1449, monster_id = 28040101, pos = { x = 2521.5, y = 202.4, z = -1101.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "水族" },
	{ config_id = 1450, monster_id = 28040103, pos = { x = 2505.7, y = 202.4, z = -1101.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "水族" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 755, 756, 757, 978, 979, 1446, 1447, 1448, 1449, 1450 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
