--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 219, monster_id = 28030101, pos = { x = 1860.2, y = 268.5, z = -936.3 }, rot = { x = 0.0, y = 42.6, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 220, monster_id = 28020102, pos = { x = 1873.5, y = 248.6, z = -945.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 224, monster_id = 28020102, pos = { x = 1668.3, y = 249.8, z = -549.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 4, drop_tag = "走兽" },
	{ config_id = 225, monster_id = 28020102, pos = { x = 1894.3, y = 235.5, z = -324.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 4, drop_tag = "走兽" },
	{ config_id = 239, monster_id = 28030101, pos = { x = 1861.8, y = 251.3, z = -914.1 }, rot = { x = 0.0, y = 67.5, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 240, monster_id = 28030101, pos = { x = 1863.4, y = 250.9, z = -916.6 }, rot = { x = 0.0, y = 199.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 780, monster_id = 28030101, pos = { x = 2025.0, y = 260.9, z = -367.7 }, rot = { x = 0.0, y = 67.5, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 781, monster_id = 28030101, pos = { x = 2026.8, y = 261.0, z = -370.4 }, rot = { x = 0.0, y = 1.7, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 782, monster_id = 28030101, pos = { x = 2031.4, y = 261.9, z = -367.8 }, rot = { x = 0.0, y = 243.9, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 783, monster_id = 28030101, pos = { x = 2039.9, y = 262.0, z = -373.8 }, rot = { x = 0.0, y = 216.1, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 219, 220, 224, 225, 239, 240, 780, 781, 782, 783 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
