--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 851, monster_id = 20011301, pos = { x = 1469.5, y = 309.5, z = -1942.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 22, drop_tag = "史莱姆", disableWander = true, affix = { 1001 }, isElite = true },
	{ config_id = 852, monster_id = 20011201, pos = { x = 1495.4, y = 309.6, z = -1948.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 22, drop_tag = "史莱姆" },
	{ config_id = 853, monster_id = 20011201, pos = { x = 1481.1, y = 307.0, z = -1924.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 22, drop_tag = "史莱姆" },
	{ config_id = 854, monster_id = 20011201, pos = { x = 1454.1, y = 312.1, z = -1947.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 22, drop_tag = "史莱姆" },
	{ config_id = 855, monster_id = 20011201, pos = { x = 1454.5, y = 306.5, z = -1923.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 22, drop_tag = "史莱姆" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3024, gadget_id = 70310001, pos = { x = 1424.8, y = 308.6, z = -1931.3 }, rot = { x = 0.0, y = 304.0, z = 0.0 }, level = 15, state = GadgetState.GearStart }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 851, 852, 853, 854, 855 },
		gadgets = { 3024 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
