--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 301, monster_id = 28010201, pos = { x = 1782.0, y = 236.2, z = -858.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 302, monster_id = 28010201, pos = { x = 1762.9, y = 236.1, z = -878.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 742, monster_id = 28010201, pos = { x = 1929.8, y = 209.8, z = -707.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 743, monster_id = 28010201, pos = { x = 1935.5, y = 213.7, z = -652.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 744, monster_id = 28010201, pos = { x = 1965.4, y = 220.4, z = -595.9 }, rot = { x = 0.0, y = 318.1, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 745, monster_id = 28010201, pos = { x = 1973.7, y = 219.9, z = -526.2 }, rot = { x = 0.0, y = 318.1, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 799, monster_id = 28010201, pos = { x = 1854.2, y = 249.9, z = -1005.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 800, monster_id = 28010201, pos = { x = 1874.2, y = 248.6, z = -954.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 801, monster_id = 28010201, pos = { x = 1910.0, y = 248.7, z = -1009.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 802, monster_id = 28010201, pos = { x = 1954.8, y = 242.8, z = -1022.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 830, monster_id = 28010201, pos = { x = 1943.7, y = 213.2, z = -674.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 831, monster_id = 28010201, pos = { x = 1928.6, y = 217.2, z = -635.5 }, rot = { x = 0.0, y = 161.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 832, monster_id = 28010201, pos = { x = 1952.7, y = 223.3, z = -509.7 }, rot = { x = 0.0, y = 27.2, z = 0.0 }, level = 1, drop_tag = "采集动物" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 301, 302, 742, 743, 744, 745, 799, 800, 801, 802, 830, 831, 832 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
