--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 698001, monster_id = 21010201, pos = { x = 1444.8, y = 251.8, z = 480.8 }, rot = { x = 0.0, y = 70.4, z = 0.0 }, level = 18, drop_tag = "丘丘人", disableWander = true, isOneoff = true, pose_id = 9010 },
	{ config_id = 698002, monster_id = 21010201, pos = { x = 1448.4, y = 252.1, z = 483.7 }, rot = { x = 0.0, y = 209.8, z = 0.0 }, level = 18, drop_tag = "丘丘人", disableWander = true, isOneoff = true, pose_id = 9010 },
	{ config_id = 698003, monster_id = 21010201, pos = { x = 1448.4, y = 251.8, z = 479.9 }, rot = { x = 0.0, y = 318.4, z = 0.0 }, level = 18, drop_tag = "丘丘人", disableWander = true, isOneoff = true, pose_id = 9010 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 698001, 698002, 698003 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
