--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 305001, monster_id = 21010101, pos = { x = 1959.2, y = 202.7, z = -785.9 }, rot = { x = 0.0, y = 155.2, z = 0.0 }, level = 12, drop_tag = "丘丘人", disableWander = true, pose_id = 9010 },
	{ config_id = 305002, monster_id = 21010301, pos = { x = 1961.3, y = 202.4, z = -786.5 }, rot = { x = 0.0, y = 250.9, z = 0.0 }, level = 12, drop_tag = "丘丘人", disableWander = true, pose_id = 9010 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = suite_2,
		monsters = { 305001, 305002 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
