--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 1339, monster_id = 22010101, pos = { x = 1414.3, y = 309.2, z = -1930.2 }, rot = { x = 0.0, y = 58.3, z = 0.0 }, level = 1, drop_tag = "深渊法师", affix = { 1401 }, isElite = true },
	{ config_id = 1340, monster_id = 21010601, pos = { x = 1420.4, y = 308.9, z = -1929.9 }, rot = { x = 0.0, y = 253.2, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401 }, isElite = true },
	{ config_id = 1341, monster_id = 21010201, pos = { x = 1420.3, y = 308.7, z = -1926.5 }, rot = { x = 0.0, y = 235.5, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401 }, isElite = true },
	{ config_id = 1342, monster_id = 21010201, pos = { x = 1416.8, y = 308.7, z = -1925.9 }, rot = { x = 0.0, y = 223.4, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401 }, isElite = true },
	{ config_id = 1343, monster_id = 21010601, pos = { x = 1418.0, y = 309.3, z = -1932.3 }, rot = { x = 0.0, y = 359.9, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401 }, isElite = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3261, gadget_id = 70300107, pos = { x = 1415.8, y = 309.1, z = -1929.2 }, rot = { x = 0.0, y = 323.7, z = 0.0 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 3262, gadget_id = 70220013, pos = { x = 1418.8, y = 310.3, z = -1936.9 }, rot = { x = 0.0, y = 71.3, z = 11.0 }, level = 1 },
	{ config_id = 3263, gadget_id = 70220013, pos = { x = 1416.7, y = 310.1, z = -1936.4 }, rot = { x = 11.5, y = 2.5, z = 2.8 }, level = 1 },
	{ config_id = 3354, gadget_id = 70220014, pos = { x = 1421.6, y = 309.9, z = -1936.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 3355, gadget_id = 70220014, pos = { x = 1418.1, y = 309.9, z = -1935.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = suite_1,
		monsters = { 1339, 1340, 1341, 1342, 1343 },
		gadgets = { 3261, 3262, 3263, 3354, 3355 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
