--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 122001, monster_id = 28030101, pos = { x = 1560.1, y = 229.1, z = 1396.6 }, rot = { x = 0.0, y = 270.6, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 122002, monster_id = 28030101, pos = { x = 1556.0, y = 227.5, z = 1391.7 }, rot = { x = 0.0, y = 358.4, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 122003, monster_id = 28010301, pos = { x = 1566.2, y = 227.2, z = 1390.5 }, rot = { x = 0.0, y = 337.7, z = 0.0 }, level = 19, drop_tag = "采集动物" },
	{ config_id = 122004, monster_id = 28010301, pos = { x = 1552.6, y = 227.4, z = 1399.2 }, rot = { x = 0.0, y = 0.5, z = 0.0 }, level = 19, drop_tag = "采集动物" },
	{ config_id = 122005, monster_id = 28040102, pos = { x = 1325.2, y = 226.1, z = 1313.7 }, rot = { x = 0.0, y = 125.4, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 122006, monster_id = 28040102, pos = { x = 1324.9, y = 226.1, z = 1318.6 }, rot = { x = 0.0, y = 323.9, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 122007, monster_id = 28040102, pos = { x = 1328.2, y = 226.1, z = 1317.2 }, rot = { x = 0.0, y = 205.4, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 122008, monster_id = 28040102, pos = { x = 1330.7, y = 226.1, z = 1327.6 }, rot = { x = 0.0, y = 9.6, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 122009, monster_id = 28030502, pos = { x = 1330.6, y = 227.2, z = 1325.7 }, rot = { x = 0.0, y = 142.4, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 122010, monster_id = 28030502, pos = { x = 1329.1, y = 227.2, z = 1320.0 }, rot = { x = 0.0, y = 311.4, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 122011, monster_id = 28030502, pos = { x = 1333.9, y = 227.2, z = 1301.3 }, rot = { x = 0.0, y = 308.3, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 122012, monster_id = 28010301, pos = { x = 1408.2, y = 228.3, z = 1351.4 }, rot = { x = 0.0, y = 337.7, z = 0.0 }, level = 19, drop_tag = "采集动物" },
	{ config_id = 122013, monster_id = 28010301, pos = { x = 1403.7, y = 229.9, z = 1359.1 }, rot = { x = 0.0, y = 0.5, z = 0.0 }, level = 19, drop_tag = "采集动物" },
	{ config_id = 122014, monster_id = 28030101, pos = { x = 1458.2, y = 229.2, z = 1409.6 }, rot = { x = 0.0, y = 87.7, z = 0.0 }, level = 19, drop_tag = "鸟类" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 122001, 122002, 122003, 122004, 122005, 122006, 122007, 122008, 122009, 122010, 122011, 122012, 122013, 122014 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
