--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 134001, monster_id = 28030401, pos = { x = 1130.5, y = 225.8, z = 1085.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 134002, monster_id = 28030401, pos = { x = 1129.8, y = 225.9, z = 1085.8 }, rot = { x = 0.0, y = 87.7, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 134003, monster_id = 28030401, pos = { x = 1111.4, y = 227.8, z = 1091.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 134004, monster_id = 28010202, pos = { x = 1121.9, y = 221.3, z = 1065.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 134005, monster_id = 28010202, pos = { x = 1119.8, y = 225.1, z = 1086.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 134006, monster_id = 28020102, pos = { x = 1271.5, y = 221.6, z = 1073.3 }, rot = { x = 0.0, y = 225.2, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 134007, monster_id = 28020102, pos = { x = 1244.2, y = 228.6, z = 1068.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 134008, monster_id = 28030402, pos = { x = 1229.8, y = 236.2, z = 1090.3 }, rot = { x = 0.0, y = 110.3, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 134009, monster_id = 28030402, pos = { x = 1236.7, y = 236.5, z = 1096.6 }, rot = { x = 0.0, y = 280.0, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 134010, monster_id = 28030402, pos = { x = 1230.4, y = 235.7, z = 1085.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 134011, monster_id = 28030402, pos = { x = 1237.3, y = 234.2, z = 1089.9 }, rot = { x = 0.0, y = 322.7, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 134012, monster_id = 28030401, pos = { x = 1268.0, y = 214.2, z = 1043.4 }, rot = { x = 0.0, y = 285.5, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 134013, monster_id = 28030401, pos = { x = 1264.1, y = 216.4, z = 1044.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 901 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 134001, 134002, 134003, 134004, 134005, 134006, 134007, 134008, 134009, 134010, 134011, 134012, 134013 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
