--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 292001, monster_id = 21010101, pos = { x = 507.7, y = 225.2, z = 812.9 }, rot = { x = 356.5, y = 0.2, z = 0.1 }, level = 19, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 292002, monster_id = 21010101, pos = { x = 511.2, y = 225.2, z = 814.4 }, rot = { x = 2.2, y = 230.2, z = 1.0 }, level = 19, drop_tag = "丘丘人", disableWander = true, pose_id = 9002 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 292004, gadget_id = 70220014, pos = { x = 506.8, y = 225.0, z = 809.6 }, rot = { x = 357.9, y = 357.0, z = 1.2 }, level = 19 },
	{ config_id = 292005, gadget_id = 70220014, pos = { x = 507.8, y = 225.0, z = 810.3 }, rot = { x = 357.8, y = 0.1, z = 1.1 }, level = 19 },
	{ config_id = 292006, gadget_id = 70220014, pos = { x = 509.0, y = 225.0, z = 808.2 }, rot = { x = 357.8, y = 0.1, z = 1.1 }, level = 19 },
	{ config_id = 292007, gadget_id = 70220013, pos = { x = 513.0, y = 225.0, z = 813.5 }, rot = { x = 356.6, y = 0.2, z = 355.8 }, level = 19 },
	{ config_id = 292008, gadget_id = 70211101, pos = { x = 512.8, y = 224.9, z = 811.3 }, rot = { x = 354.8, y = 292.4, z = 1.6 }, level = 19, drop_tag = "解谜低级璃月", isOneoff = true, persistent = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 292001, 292002 },
		gadgets = { 292004, 292005, 292006, 292007, 292008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
