--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 130001, monster_id = 20010201, pos = { x = -212.2, y = 181.7, z = 861.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130002, monster_id = 20010201, pos = { x = -776.9, y = 183.3, z = 1134.2 }, rot = { x = 0.0, y = 89.6, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130004, monster_id = 20010201, pos = { x = -394.7, y = 258.6, z = 646.8 }, rot = { x = 0.0, y = 18.5, z = 0.0 }, level = 24, drop_tag = "史莱姆" },
	{ config_id = 130005, monster_id = 20010201, pos = { x = -818.3, y = 177.7, z = 857.4 }, rot = { x = 0.0, y = 184.0, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130006, monster_id = 20010201, pos = { x = -318.8, y = 211.2, z = 1101.2 }, rot = { x = 0.0, y = 61.5, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130007, monster_id = 20010201, pos = { x = -1010.8, y = 222.9, z = 930.3 }, rot = { x = 0.0, y = 233.7, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130008, monster_id = 20010201, pos = { x = -602.6, y = 200.5, z = 1197.8 }, rot = { x = 0.0, y = 91.6, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130009, monster_id = 20010201, pos = { x = -659.0, y = 207.1, z = 1446.1 }, rot = { x = 0.0, y = 339.0, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130010, monster_id = 20010201, pos = { x = -190.2, y = 328.0, z = 649.6 }, rot = { x = 0.0, y = 88.0, z = 0.0 }, level = 24, drop_tag = "史莱姆" },
	{ config_id = 130011, monster_id = 20010201, pos = { x = -147.7, y = 313.8, z = 1571.1 }, rot = { x = 0.0, y = 68.4, z = 0.0 }, level = 24, drop_tag = "史莱姆" },
	{ config_id = 130012, monster_id = 20010201, pos = { x = -616.5, y = 254.0, z = 635.9 }, rot = { x = 0.0, y = 325.4, z = 0.0 }, level = 24, drop_tag = "史莱姆" },
	{ config_id = 130013, monster_id = 20010201, pos = { x = -7.2, y = 280.1, z = 775.1 }, rot = { x = 0.0, y = 293.1, z = 0.0 }, level = 24, drop_tag = "史莱姆" },
	{ config_id = 130014, monster_id = 20010201, pos = { x = -207.4, y = 280.5, z = 1361.6 }, rot = { x = 0.0, y = 181.3, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130015, monster_id = 20010201, pos = { x = -420.8, y = 257.4, z = 1282.7 }, rot = { x = 0.0, y = 176.7, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130016, monster_id = 20010201, pos = { x = -788.6, y = 155.5, z = 1292.6 }, rot = { x = 0.0, y = 306.1, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130017, monster_id = 20010201, pos = { x = -94.9, y = 200.0, z = 959.8 }, rot = { x = 0.0, y = 231.4, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130018, monster_id = 20010101, pos = { x = -899.5, y = 213.5, z = 1610.0 }, rot = { x = 0.0, y = 132.8, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130019, monster_id = 20010101, pos = { x = -1.3, y = 279.9, z = 1425.9 }, rot = { x = 0.0, y = 79.7, z = 0.0 }, level = 24, drop_tag = "史莱姆" },
	{ config_id = 130020, monster_id = 20010101, pos = { x = -1000.0, y = 237.3, z = 1255.4 }, rot = { x = 0.0, y = 346.7, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130021, monster_id = 20010101, pos = { x = -491.6, y = 186.0, z = 883.6 }, rot = { x = 0.0, y = 323.5, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130022, monster_id = 20010101, pos = { x = -277.6, y = 186.2, z = 854.8 }, rot = { x = 0.0, y = 355.0, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130023, monster_id = 20010101, pos = { x = -65.4, y = 260.4, z = 1180.6 }, rot = { x = 0.0, y = 168.1, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130024, monster_id = 20010101, pos = { x = -878.8, y = 200.6, z = 1090.9 }, rot = { x = 0.0, y = 174.8, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130025, monster_id = 20010101, pos = { x = -461.0, y = 241.7, z = 1591.0 }, rot = { x = 0.0, y = 266.9, z = 0.0 }, level = 32, drop_tag = "史莱姆" },
	{ config_id = 130026, monster_id = 20010101, pos = { x = -693.2, y = 190.2, z = 1013.6 }, rot = { x = 0.0, y = 353.0, z = 0.0 }, level = 32, drop_tag = "史莱姆" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 130001, 130002, 130004, 130005, 130006, 130007, 130008, 130009, 130010, 130011, 130012, 130013, 130014, 130015, 130016, 130017, 130018, 130019, 130020, 130021, 130022, 130023, 130024, 130025, 130026 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
