--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 806001, monster_id = 28020201, pos = { x = 637.8, y = 275.4, z = -203.7 }, rot = { x = 0.0, y = 266.1, z = 0.0 }, level = 25, drop_tag = "走兽" },
	{ config_id = 806002, monster_id = 28020201, pos = { x = 985.1, y = 250.7, z = -126.9 }, rot = { x = 0.0, y = 186.2, z = 0.0 }, level = 25, drop_tag = "走兽" },
	{ config_id = 806003, monster_id = 28020201, pos = { x = 823.2, y = 263.8, z = -189.7 }, rot = { x = 0.0, y = 102.6, z = 0.0 }, level = 25, drop_tag = "走兽" },
	{ config_id = 806004, monster_id = 28020201, pos = { x = 674.5, y = 246.1, z = -505.9 }, rot = { x = 0.0, y = 99.5, z = 0.0 }, level = 25, drop_tag = "走兽" },
	{ config_id = 806005, monster_id = 28020201, pos = { x = 897.4, y = 297.7, z = -397.0 }, rot = { x = 0.0, y = 168.1, z = 0.0 }, level = 25, drop_tag = "走兽" },
	{ config_id = 806006, monster_id = 28020201, pos = { x = 812.2, y = 260.3, z = -338.5 }, rot = { x = 9.6, y = 84.5, z = 7.0 }, level = 25, drop_tag = "走兽" },
	{ config_id = 806007, monster_id = 28020201, pos = { x = 956.3, y = 224.2, z = -32.4 }, rot = { x = 0.0, y = 253.2, z = 0.0 }, level = 25, drop_tag = "走兽" },
	{ config_id = 806008, monster_id = 28020201, pos = { x = 816.4, y = 226.4, z = -96.3 }, rot = { x = 0.0, y = 48.9, z = 0.0 }, level = 25, drop_tag = "走兽" },
	{ config_id = 806009, monster_id = 28020201, pos = { x = 751.6, y = 294.3, z = -453.3 }, rot = { x = 0.0, y = 247.6, z = 0.0 }, level = 25, drop_tag = "走兽" },
	{ config_id = 806011, monster_id = 28020201, pos = { x = 918.4, y = 260.6, z = -267.6 }, rot = { x = 0.0, y = 108.4, z = 0.0 }, level = 25, drop_tag = "走兽" },
	{ config_id = 806012, monster_id = 28040101, pos = { x = 748.4, y = 199.6, z = -11.9 }, rot = { x = 0.0, y = 282.8, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 806013, monster_id = 28020201, pos = { x = 941.7, y = 270.6, z = -258.7 }, rot = { x = 0.0, y = 11.0, z = 0.0 }, level = 25, drop_tag = "走兽" },
	{ config_id = 806014, monster_id = 28040101, pos = { x = 745.6, y = 199.6, z = -11.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 806015, monster_id = 28040101, pos = { x = 746.8, y = 199.6, z = -16.3 }, rot = { x = 0.0, y = 277.3, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 806016, monster_id = 28040102, pos = { x = 748.6, y = 199.6, z = -15.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 806017, monster_id = 28040102, pos = { x = 761.5, y = 199.6, z = -19.0 }, rot = { x = 0.0, y = 55.4, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 806018, monster_id = 28040102, pos = { x = 717.4, y = 199.6, z = -3.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 806019, monster_id = 28040102, pos = { x = 718.0, y = 199.6, z = -0.2 }, rot = { x = 0.0, y = 104.3, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 806020, monster_id = 28040102, pos = { x = 721.6, y = 199.6, z = -2.0 }, rot = { x = 0.0, y = 296.7, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 806021, monster_id = 28040102, pos = { x = 725.8, y = 200.0, z = 3.6 }, rot = { x = 0.0, y = 77.8, z = 0.0 }, level = 19, drop_tag = "水族" },
	{ config_id = 806022, monster_id = 28040102, pos = { x = 739.6, y = 200.0, z = 6.0 }, rot = { x = 0.0, y = 47.7, z = 0.0 }, level = 19, drop_tag = "水族" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 806001, 806002, 806003, 806004, 806005, 806006, 806007, 806008, 806009, 806011, 806012, 806013, 806014, 806015, 806016, 806017, 806018, 806019, 806020, 806021, 806022 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
