--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 396001, monster_id = 28010301, pos = { x = 300.9, y = 185.6, z = 1442.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 396002, monster_id = 28010301, pos = { x = 303.9, y = 186.0, z = 1432.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 396003, monster_id = 28040102, pos = { x = 307.0, y = 184.6, z = 1524.5 }, rot = { x = 0.0, y = 192.2, z = 0.0 }, level = 24, drop_tag = "水族" },
	{ config_id = 396004, monster_id = 28040102, pos = { x = 305.3, y = 184.6, z = 1519.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "水族" },
	{ config_id = 396005, monster_id = 28040102, pos = { x = 303.4, y = 184.6, z = 1523.5 }, rot = { x = 0.0, y = 142.3, z = 0.0 }, level = 24, drop_tag = "水族" },
	{ config_id = 396006, monster_id = 28040102, pos = { x = 305.5, y = 184.1, z = 1485.9 }, rot = { x = 0.0, y = 223.4, z = 0.0 }, level = 24, drop_tag = "水族" },
	{ config_id = 396007, monster_id = 28040102, pos = { x = 293.7, y = 184.1, z = 1491.0 }, rot = { x = 0.0, y = 161.5, z = 0.0 }, level = 24, drop_tag = "水族" },
	{ config_id = 396008, monster_id = 28040102, pos = { x = 289.1, y = 184.1, z = 1475.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "水族" },
	{ config_id = 396009, monster_id = 28030501, pos = { x = 297.3, y = 185.3, z = 1451.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 396010, monster_id = 28030501, pos = { x = 295.4, y = 185.3, z = 1455.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 396011, monster_id = 28040102, pos = { x = 289.6, y = 184.5, z = 1415.8 }, rot = { x = 0.0, y = 161.5, z = 0.0 }, level = 24, drop_tag = "水族" },
	{ config_id = 396012, monster_id = 28040103, pos = { x = 294.2, y = 184.6, z = 1414.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "水族" },
	{ config_id = 396013, monster_id = 28030101, pos = { x = 267.3, y = 189.0, z = 1403.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 396014, monster_id = 28030101, pos = { x = 275.6, y = 187.9, z = 1416.0 }, rot = { x = 0.0, y = 189.9, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 396015, monster_id = 28030101, pos = { x = 286.2, y = 185.8, z = 1434.1 }, rot = { x = 0.0, y = 42.9, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 396001, 396002, 396003, 396004, 396005, 396006, 396007, 396008, 396009, 396010, 396011, 396012, 396013, 396014, 396015 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
