--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 299001, monster_id = 28020102, pos = { x = 1582.8, y = 200.7, z = -264.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 299002, monster_id = 28020102, pos = { x = 1583.5, y = 200.7, z = -263.7 }, rot = { x = 0.0, y = 211.5, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 299003, monster_id = 28030303, pos = { x = 1545.5, y = 223.4, z = -188.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 299004, monster_id = 28030303, pos = { x = 1542.6, y = 223.5, z = -185.4 }, rot = { x = 0.0, y = 332.2, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 299005, monster_id = 28030303, pos = { x = 1542.7, y = 222.9, z = -187.1 }, rot = { x = 0.0, y = 8.1, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 299006, monster_id = 28010301, pos = { x = 1596.9, y = 200.0, z = -259.0 }, rot = { x = 0.0, y = 86.3, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 299007, monster_id = 28010302, pos = { x = 1596.3, y = 200.0, z = -261.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 299008, monster_id = 28010302, pos = { x = 1601.7, y = 200.0, z = -274.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 299009, monster_id = 28010302, pos = { x = 1552.5, y = 233.6, z = -144.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 299010, monster_id = 28010301, pos = { x = 1565.5, y = 233.5, z = -145.0 }, rot = { x = 0.0, y = 253.7, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 299011, monster_id = 28020301, pos = { x = 1622.8, y = 240.1, z = -162.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 299012, monster_id = 28020301, pos = { x = 1620.0, y = 239.6, z = -162.9 }, rot = { x = 0.0, y = 31.4, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 299013, monster_id = 28030303, pos = { x = 1568.9, y = 248.0, z = -37.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 299014, monster_id = 28030303, pos = { x = 1566.0, y = 248.3, z = -34.7 }, rot = { x = 0.0, y = 332.2, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 299015, monster_id = 28030303, pos = { x = 1566.1, y = 248.2, z = -36.4 }, rot = { x = 0.0, y = 8.1, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 299016, monster_id = 28010203, pos = { x = 1619.5, y = 233.9, z = 4.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 299017, monster_id = 28010203, pos = { x = 1616.6, y = 233.8, z = 4.1 }, rot = { x = 0.0, y = 120.9, z = 0.0 }, level = 1, drop_tag = "采集动物" },
	{ config_id = 299018, monster_id = 28050101, pos = { x = 1543.7, y = 207.5, z = -238.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 299019, monster_id = 28050101, pos = { x = 1599.5, y = 241.2, z = -12.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 299020, monster_id = 28020201, pos = { x = 1714.8, y = 226.6, z = 41.8 }, rot = { x = 8.6, y = 0.4, z = 5.7 }, level = 1, drop_tag = "走兽" },
	{ config_id = 299021, monster_id = 28020201, pos = { x = 1714.4, y = 226.4, z = 42.8 }, rot = { x = 349.2, y = 139.6, z = 1.4 }, level = 1, drop_tag = "走兽" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 299001, 299002, 299003, 299004, 299005, 299006, 299007, 299008, 299009, 299010, 299011, 299012, 299013, 299014, 299015, 299016, 299017, 299018, 299019, 299020, 299021 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
