--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 137001, monster_id = 25030201, pos = { x = 1203.8, y = 248.0, z = 1177.8 }, rot = { x = 0.0, y = 300.3, z = 0.0 }, level = 26, drop_tag = "盗宝团" },
	{ config_id = 137002, monster_id = 25010201, pos = { x = 1255.8, y = 266.9, z = 1272.6 }, rot = { x = 0.0, y = 348.4, z = 0.0 }, level = 26, drop_tag = "盗宝团", disableWander = true, pose_id = 0 },
	{ config_id = 137003, monster_id = 25010201, pos = { x = 1255.3, y = 266.6, z = 1276.2 }, rot = { x = 0.0, y = 157.1, z = 0.0 }, level = 26, drop_tag = "盗宝团", disableWander = true, pose_id = 0 },
	{ config_id = 137004, monster_id = 25030201, pos = { x = 1269.4, y = 267.0, z = 1346.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25, drop_tag = "盗宝团" },
	{ config_id = 137005, monster_id = 25020201, pos = { x = 1212.2, y = 261.3, z = 1298.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 26, drop_tag = "盗宝团" },
	{ config_id = 137006, monster_id = 25040201, pos = { x = 1212.9, y = 261.4, z = 1301.1 }, rot = { x = 0.0, y = 32.6, z = 0.0 }, level = 26, drop_tag = "盗宝团" },
	{ config_id = 137007, monster_id = 25010201, pos = { x = 1165.0, y = 260.9, z = 1279.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 26, drop_tag = "盗宝团" },
	{ config_id = 137008, monster_id = 25020201, pos = { x = 1173.4, y = 265.7, z = 1358.1 }, rot = { x = 0.0, y = 276.0, z = 0.0 }, level = 26, drop_tag = "盗宝团", disableWander = true, pose_id = 0 },
	{ config_id = 137009, monster_id = 25020201, pos = { x = 1170.4, y = 266.2, z = 1358.4 }, rot = { x = 0.0, y = 110.6, z = 0.0 }, level = 26, drop_tag = "盗宝团", disableWander = true, pose_id = 0 },
	{ config_id = 137010, monster_id = 25010201, pos = { x = 1129.5, y = 269.3, z = 1302.0 }, rot = { x = 0.0, y = 295.4, z = 0.0 }, level = 26, drop_tag = "盗宝团" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 137001, 137002, 137003, 137004, 137005, 137006, 137007, 137008, 137009, 137010 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
