--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 462001, gadget_id = 70310006, pos = { x = 1698.0, y = 245.9, z = 768.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 18 },
	{ config_id = 462003, gadget_id = 70310004, pos = { x = 1705.6, y = 246.5, z = 766.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 18 },
	{ config_id = 462010, gadget_id = 70211001, pos = { x = 1598.2, y = 277.2, z = 779.4 }, rot = { x = 0.0, y = 138.7, z = 0.0 }, level = 18, drop_tag = "战斗低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 462011, gadget_id = 70211001, pos = { x = 1698.7, y = 246.5, z = 773.4 }, rot = { x = 0.6, y = 3.6, z = 4.5 }, level = 18, drop_tag = "战斗低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 462012, gadget_id = 70211001, pos = { x = 1730.8, y = 250.0, z = 755.7 }, rot = { x = 360.0, y = 181.4, z = 359.9 }, level = 18, drop_tag = "战斗低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 462001, 462003, 462010, 462011, 462012 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
