--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 407001, monster_id = 22010201, pos = { x = 709.6, y = 200.4, z = 179.8 }, rot = { x = 353.9, y = 229.1, z = 355.6 }, level = 1, drop_tag = "深渊法师", affix = { 1403, 1408 }, isElite = true, pose_id = 9013 },
	{ config_id = 407002, monster_id = 21010601, pos = { x = 705.5, y = 202.4, z = 171.1 }, rot = { x = 359.2, y = 284.4, z = 352.4 }, level = 1, drop_tag = "丘丘人", affix = { 1403, 1408 }, isElite = true, pose_id = 9012 },
	{ config_id = 407003, monster_id = 21010201, pos = { x = 697.1, y = 203.4, z = 173.9 }, rot = { x = 350.1, y = 138.7, z = 359.7 }, level = 1, drop_tag = "丘丘人", affix = { 1403, 1408 }, isElite = true, pose_id = 9012 },
	{ config_id = 407004, monster_id = 21010201, pos = { x = 699.1, y = 202.9, z = 168.5 }, rot = { x = 1.5, y = 19.1, z = 355.8 }, level = 1, drop_tag = "丘丘人", affix = { 1403, 1408 }, isElite = true, pose_id = 9012 },
	{ config_id = 407005, monster_id = 21010601, pos = { x = 703.3, y = 202.1, z = 176.2 }, rot = { x = 350.5, y = 219.3, z = 358.8 }, level = 1, drop_tag = "丘丘人", affix = { 1408 }, isElite = true, pose_id = 9012 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 407006, gadget_id = 70300107, pos = { x = 700.9, y = 202.6, z = 172.6 }, rot = { x = 358.1, y = 325.3, z = 352.6 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 407007, gadget_id = 70220013, pos = { x = 707.0, y = 203.3, z = 164.2 }, rot = { x = 1.4, y = 68.0, z = 8.1 }, level = 1 },
	{ config_id = 407008, gadget_id = 70220013, pos = { x = 692.5, y = 203.6, z = 169.4 }, rot = { x = 1.6, y = 334.0, z = 3.2 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = suite_1,
		monsters = { 407001, 407002, 407003, 407004, 407005 },
		gadgets = { 407006, 407007, 407008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
