--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 911, monster_id = 21010701, pos = { x = 2764.5, y = 259.9, z = -1231.2 }, rot = { x = 0.0, y = 184.2, z = 0.0 }, level = 15, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 912, monster_id = 21010101, pos = { x = 2764.6, y = 259.4, z = -1234.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 15, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 913, monster_id = 21010101, pos = { x = 2766.8, y = 259.8, z = -1232.3 }, rot = { x = 0.0, y = 270.6, z = 0.0 }, level = 15, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 914, monster_id = 21010501, pos = { x = 2789.6, y = 265.8, z = -1219.3 }, rot = { x = 0.0, y = 250.5, z = 0.0 }, level = 15, drop_tag = "远程丘丘人", disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3008, gadget_id = 70310004, pos = { x = 2764.4, y = 259.7, z = -1232.6 }, rot = { x = 0.0, y = 118.4, z = 0.0 }, level = 30 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 911, 912, 913, 914 },
		gadgets = { 3008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
