--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 1195, monster_id = 28030401, pos = { x = 1418.3, y = 267.1, z = -1636.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1196, monster_id = 28030401, pos = { x = 1419.1, y = 267.9, z = -1644.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1197, monster_id = 28020201, pos = { x = 1455.5, y = 268.2, z = -1627.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 1199, monster_id = 28030101, pos = { x = 1380.3, y = 273.9, z = -1694.3 }, rot = { x = 0.0, y = 261.9, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 1210, monster_id = 28030101, pos = { x = 1407.9, y = 294.1, z = -1758.5 }, rot = { x = 0.0, y = 10.7, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 901 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3049, gadget_id = 70211103, pos = { x = 1461.7, y = 268.3, z = -1628.0 }, rot = { x = 0.0, y = 43.0, z = 0.0 }, level = 15, drop_tag = "解谜低级蒙德", state = GadgetState.ChestBramble, isOneoff = true, persistent = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 1196, 1197, 1199, 1210 },
		gadgets = { 3049 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
