--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 98, monster_id = 21020201, pos = { x = 2686.7, y = 229.8, z = 85.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 30, drop_tag = "丘丘暴徒", affix = { 1001 }, isElite = true, pose_id = 401 },
	{ config_id = 99, monster_id = 21010601, pos = { x = 2694.5, y = 239.1, z = 96.7 }, rot = { x = 0.0, y = 127.8, z = 0.0 }, level = 30, drop_tag = "丘丘人", disableWander = true, pose_id = 32 },
	{ config_id = 100, monster_id = 21010601, pos = { x = 2685.9, y = 239.6, z = 89.8 }, rot = { x = 0.0, y = 131.2, z = 0.0 }, level = 30, drop_tag = "丘丘人", disableWander = true, pose_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 225, gadget_id = 70220004, pos = { x = 2689.0, y = 229.9, z = 84.9 }, rot = { x = 0.0, y = 23.6, z = 0.0 }, level = 23 },
	{ config_id = 226, gadget_id = 70220004, pos = { x = 2691.2, y = 229.7, z = 91.9 }, rot = { x = 0.0, y = 313.6, z = 0.0 }, level = 23 },
	{ config_id = 227, gadget_id = 70220004, pos = { x = 2699.0, y = 229.7, z = 89.6 }, rot = { x = 0.0, y = 265.3, z = 0.0 }, level = 23 },
	{ config_id = 228, gadget_id = 70220004, pos = { x = 2680.5, y = 230.0, z = 83.1 }, rot = { x = 0.0, y = 262.7, z = 0.0 }, level = 23 },
	{ config_id = 229, gadget_id = 70220004, pos = { x = 2697.8, y = 229.7, z = 97.5 }, rot = { x = 0.0, y = 182.2, z = 0.0 }, level = 23 },
	{ config_id = 230, gadget_id = 70220004, pos = { x = 2674.7, y = 229.9, z = 75.6 }, rot = { x = 0.0, y = 301.0, z = 0.0 }, level = 23 },
	{ config_id = 236, gadget_id = 70220013, pos = { x = 2694.0, y = 230.5, z = 84.5 }, rot = { x = 0.0, y = 14.2, z = 0.0 }, level = 23 },
	{ config_id = 237, gadget_id = 70220013, pos = { x = 2696.5, y = 230.1, z = 85.9 }, rot = { x = 0.0, y = 248.5, z = 0.0 }, level = 23 },
	{ config_id = 238, gadget_id = 70220013, pos = { x = 2698.8, y = 229.7, z = 103.3 }, rot = { x = 0.0, y = 217.2, z = 0.0 }, level = 23 },
	{ config_id = 239, gadget_id = 70220013, pos = { x = 2669.1, y = 230.0, z = 82.4 }, rot = { x = 0.0, y = 179.5, z = 0.0 }, level = 23 },
	{ config_id = 240, gadget_id = 70220013, pos = { x = 2667.6, y = 230.0, z = 84.5 }, rot = { x = 0.0, y = 149.7, z = 0.0 }, level = 23 },
	{ config_id = 241, gadget_id = 70220013, pos = { x = 2672.9, y = 229.9, z = 74.5 }, rot = { x = 0.0, y = 338.4, z = 0.0 }, level = 23 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 98, 99, 100 },
		gadgets = { 225, 226, 227, 228, 229, 230, 236, 237, 238, 239, 240, 241 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
