--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 74001, gadget_id = 70310001, pos = { x = -517.8, y = 191.8, z = 1072.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74002, gadget_id = 70310001, pos = { x = -512.2, y = 191.9, z = 1071.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74003, gadget_id = 70310001, pos = { x = -476.2, y = 196.6, z = 1082.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 74004, gadget_id = 70310001, pos = { x = -472.4, y = 196.6, z = 1084.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 74005, gadget_id = 70220013, pos = { x = -523.2, y = 185.7, z = 1176.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74006, gadget_id = 70220014, pos = { x = -524.6, y = 185.7, z = 1175.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74007, gadget_id = 70220014, pos = { x = -526.1, y = 185.7, z = 1172.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74008, gadget_id = 70220014, pos = { x = -507.5, y = 185.7, z = 1138.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74009, gadget_id = 70220014, pos = { x = -503.8, y = 185.7, z = 1143.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74010, gadget_id = 70220014, pos = { x = -505.0, y = 185.7, z = 1143.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74011, gadget_id = 70220005, pos = { x = -504.3, y = 185.7, z = 1142.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74012, gadget_id = 70220005, pos = { x = -527.3, y = 185.7, z = 1173.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74013, gadget_id = 70220014, pos = { x = -427.5, y = 187.8, z = 1104.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74014, gadget_id = 70220014, pos = { x = -423.9, y = 187.8, z = 1100.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74015, gadget_id = 70220013, pos = { x = -425.4, y = 187.7, z = 1101.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74016, gadget_id = 70220013, pos = { x = -459.4, y = 208.4, z = 1242.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74017, gadget_id = 70220014, pos = { x = -460.1, y = 208.4, z = 1241.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74018, gadget_id = 70220014, pos = { x = -393.3, y = 207.5, z = 1211.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74019, gadget_id = 70220014, pos = { x = -406.0, y = 200.1, z = 1226.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74020, gadget_id = 70220014, pos = { x = -401.7, y = 200.1, z = 1223.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74021, gadget_id = 70220013, pos = { x = -404.7, y = 200.1, z = 1224.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74022, gadget_id = 70220014, pos = { x = -434.1, y = 199.2, z = 1089.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74023, gadget_id = 70220014, pos = { x = -433.1, y = 199.2, z = 1089.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74024, gadget_id = 70220014, pos = { x = -340.7, y = 227.9, z = 1179.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74025, gadget_id = 70220013, pos = { x = -338.2, y = 227.7, z = 1179.7 }, rot = { x = 0.0, y = 17.9, z = 0.0 }, level = 32 },
	{ config_id = 74026, gadget_id = 70310001, pos = { x = -338.3, y = 227.8, z = 1189.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 74027, gadget_id = 70220014, pos = { x = -245.1, y = 203.5, z = 1116.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74028, gadget_id = 70220014, pos = { x = -249.1, y = 203.5, z = 1125.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74029, gadget_id = 70220014, pos = { x = -249.1, y = 203.5, z = 1124.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74030, gadget_id = 70220013, pos = { x = -246.5, y = 203.6, z = 1117.2 }, rot = { x = 0.0, y = 300.0, z = 0.0 }, level = 32 },
	{ config_id = 74031, gadget_id = 70220014, pos = { x = -391.2, y = 209.0, z = 1192.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74032, gadget_id = 70220014, pos = { x = -391.3, y = 209.0, z = 1191.3 }, rot = { x = 0.0, y = 293.5, z = 0.0 }, level = 32 },
	{ config_id = 74033, gadget_id = 70220005, pos = { x = -413.5, y = 208.9, z = 1178.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 74034, gadget_id = 70220035, pos = { x = -414.3, y = 208.9, z = 1179.0 }, rot = { x = 0.0, y = 41.2, z = 0.0 }, level = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 74001, 74002, 74003, 74004, 74005, 74006, 74007, 74008, 74009, 74010, 74011, 74012, 74013, 74014, 74015, 74016, 74017, 74018, 74019, 74020, 74021, 74022, 74023, 74024, 74025, 74026, 74027, 74028, 74029, 74030, 74031, 74032, 74033, 74034 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
