--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 308001, gadget_id = 70710016, pos = { x = 1879.9, y = 239.3, z = -872.1 }, rot = { x = 0.0, y = 105.4, z = 0.0 }, level = 10 },
	{ config_id = 308002, gadget_id = 70710017, pos = { x = 1878.7, y = 239.4, z = -876.2 }, rot = { x = 0.0, y = 103.1, z = 0.0 }, level = 10 },
	{ config_id = 308003, gadget_id = 70310009, pos = { x = 1877.5, y = 239.5, z = -880.3 }, rot = { x = 352.2, y = 99.9, z = 2.7 }, level = 10, state = GadgetState.GearStart },
	{ config_id = 308004, gadget_id = 70710018, pos = { x = 1864.7, y = 238.9, z = -871.8 }, rot = { x = 0.0, y = 289.6, z = 0.0 }, level = 10 },
	{ config_id = 308005, gadget_id = 70710019, pos = { x = 1866.0, y = 238.9, z = -867.7 }, rot = { x = 0.0, y = 287.9, z = 0.0 }, level = 10 },
	{ config_id = 308006, gadget_id = 70310006, pos = { x = 1860.1, y = 239.0, z = -865.0 }, rot = { x = 0.0, y = 317.7, z = 0.0 }, level = 10, state = GadgetState.GearStart },
	{ config_id = 308007, gadget_id = 70310006, pos = { x = 1866.8, y = 239.0, z = -864.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 10, state = GadgetState.GearStart },
	{ config_id = 308008, gadget_id = 70310009, pos = { x = 1863.6, y = 239.4, z = -856.2 }, rot = { x = 0.0, y = 9.9, z = 0.0 }, level = 10, state = GadgetState.GearStart }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = suite_2,
		monsters = { },
		gadgets = { 308001, 308002, 308003, 308004, 308005, 308006, 308007, 308008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
