--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 1690, monster_id = 22010101, pos = { x = 2258.7, y = 255.5, z = -1476.6 }, rot = { x = 0.0, y = 58.3, z = 0.0 }, level = 1, drop_tag = "深渊法师", affix = { 1401 }, isElite = true },
	{ config_id = 1691, monster_id = 21010601, pos = { x = 2260.9, y = 253.0, z = -1467.7 }, rot = { x = 0.0, y = 253.2, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 1692, monster_id = 21010201, pos = { x = 2264.1, y = 253.7, z = -1472.1 }, rot = { x = 0.0, y = 235.5, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 1693, monster_id = 21010201, pos = { x = 2262.5, y = 254.5, z = -1475.4 }, rot = { x = 0.0, y = 303.2, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 1695, monster_id = 21010601, pos = { x = 2262.6, y = 253.2, z = -1469.7 }, rot = { x = 0.0, y = 255.4, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 4310, gadget_id = 70300107, pos = { x = 2259.8, y = 254.4, z = -1472.7 }, rot = { x = 0.0, y = 323.7, z = 0.0 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 4311, gadget_id = 70220013, pos = { x = 2254.7, y = 256.7, z = -1479.8 }, rot = { x = 10.6, y = 71.3, z = 0.0 }, level = 1 },
	{ config_id = 4312, gadget_id = 70220013, pos = { x = 2261.6, y = 255.7, z = -1481.9 }, rot = { x = 0.0, y = 329.2, z = 346.9 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = suite_1,
		monsters = { 1690, 1691, 1692, 1693, 1695 },
		gadgets = { 4310, 4311, 4312 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
