--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 62001, gadget_id = 70310001, pos = { x = -904.0, y = 172.4, z = 1303.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 62002, gadget_id = 70310001, pos = { x = -870.1, y = 155.5, z = 1292.1 }, rot = { x = 8.0, y = 0.2, z = 0.9 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 62003, gadget_id = 70310001, pos = { x = -865.3, y = 158.8, z = 1298.9 }, rot = { x = 8.0, y = 0.2, z = 0.9 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 62004, gadget_id = 70310001, pos = { x = -853.8, y = 160.5, z = 1282.6 }, rot = { x = 8.0, y = 0.2, z = 0.9 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 62005, gadget_id = 70310001, pos = { x = -884.7, y = 155.3, z = 1282.7 }, rot = { x = 8.0, y = 0.2, z = 0.9 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 62006, gadget_id = 70220014, pos = { x = -887.6, y = 155.3, z = 1282.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 62007, gadget_id = 70220014, pos = { x = -886.4, y = 155.3, z = 1282.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 62008, gadget_id = 70220014, pos = { x = -881.9, y = 155.4, z = 1293.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 62009, gadget_id = 70220014, pos = { x = -881.7, y = 155.3, z = 1295.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 62010, gadget_id = 70220013, pos = { x = -883.5, y = 155.4, z = 1294.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 62011, gadget_id = 70300085, pos = { x = -862.6, y = 160.4, z = 1284.0 }, rot = { x = 0.0, y = 38.8, z = 0.0 }, level = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 62001, 62002, 62003, 62004, 62005, 62006, 62007, 62008, 62009, 62010, 62011 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
