--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 120001, gadget_id = 70310006, pos = { x = -959.8, y = 210.5, z = 1221.3 }, rot = { x = 4.6, y = 359.6, z = 351.1 }, level = 32 },
	{ config_id = 120002, gadget_id = 70210101, pos = { x = -964.3, y = 211.9, z = 1219.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, drop_tag = "搜刮点解谜通用璃月", persistent = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 120003, gadget_id = 70210101, pos = { x = -968.9, y = 212.6, z = 1223.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, drop_tag = "搜刮点解谜通用璃月", persistent = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 120004, gadget_id = 70210101, pos = { x = -965.9, y = 212.4, z = 1218.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, drop_tag = "搜刮点解谜通用璃月", persistent = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 120001, 120002, 120003, 120004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
