--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 1680, monster_id = 22010201, pos = { x = 2802.5, y = 271.1, z = -1488.7 }, rot = { x = 0.0, y = 58.3, z = 0.0 }, level = 1, drop_tag = "深渊法师", affix = { 1401 }, isElite = true },
	{ config_id = 1681, monster_id = 21010601, pos = { x = 2809.5, y = 271.7, z = -1488.2 }, rot = { x = 0.0, y = 292.0, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 1682, monster_id = 21010201, pos = { x = 2808.5, y = 271.2, z = -1484.4 }, rot = { x = 0.0, y = 215.2, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 1683, monster_id = 21010201, pos = { x = 2804.0, y = 270.4, z = -1483.0 }, rot = { x = 0.0, y = 223.4, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 1684, monster_id = 21010601, pos = { x = 2805.8, y = 272.0, z = -1491.0 }, rot = { x = 0.0, y = 359.9, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 4308, gadget_id = 70300107, pos = { x = 2805.1, y = 271.2, z = -1486.1 }, rot = { x = 0.0, y = 71.3, z = 0.0 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 4309, gadget_id = 70220013, pos = { x = 2811.5, y = 272.0, z = -1493.2 }, rot = { x = 0.0, y = 329.2, z = 0.0 }, level = 1 },
	{ config_id = 4453, gadget_id = 70220013, pos = { x = 2807.9, y = 272.7, z = -1494.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 4457, gadget_id = 70220014, pos = { x = 2802.9, y = 271.9, z = -1493.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 4458, gadget_id = 70220014, pos = { x = 2804.3, y = 272.0, z = -1492.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = suite_1,
		monsters = { 1680, 1681, 1682, 1683, 1684 },
		gadgets = { 4308, 4309, 4453, 4457, 4458 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
