--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 325001, monster_id = 21010101, pos = { x = 1200.1, y = 259.2, z = -1542.2 }, rot = { x = 0.0, y = 35.3, z = 0.0 }, level = 19, drop_tag = "丘丘人", pose_id = 9012 },
	{ config_id = 325002, monster_id = 21010101, pos = { x = 1200.2, y = 259.2, z = -1540.4 }, rot = { x = 0.0, y = 123.8, z = 0.0 }, level = 19, drop_tag = "丘丘人", pose_id = 9012 },
	{ config_id = 325003, monster_id = 21010101, pos = { x = 1201.9, y = 259.2, z = -1541.6 }, rot = { x = 0.0, y = 303.8, z = 0.0 }, level = 19, drop_tag = "丘丘人", pose_id = 9012 },
	{ config_id = 325004, monster_id = 21010101, pos = { x = 1201.9, y = 259.2, z = -1539.8 }, rot = { x = 0.0, y = 216.2, z = 0.0 }, level = 19, drop_tag = "丘丘人", pose_id = 9012 },
	{ config_id = 325005, monster_id = 21010701, pos = { x = 1226.2, y = 259.6, z = -1553.0 }, rot = { x = 0.0, y = 347.7, z = 0.0 }, level = 19, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 325006, monster_id = 21010701, pos = { x = 1261.3, y = 255.1, z = -1534.8 }, rot = { x = 0.0, y = 74.0, z = 0.0 }, level = 19, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 325007, monster_id = 21010401, pos = { x = 1262.7, y = 255.1, z = -1533.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "远程丘丘人", pose_id = 9002 },
	{ config_id = 325008, monster_id = 21010401, pos = { x = 1290.7, y = 256.5, z = -1465.3 }, rot = { x = 0.0, y = 271.4, z = 0.0 }, level = 18, drop_tag = "远程丘丘人", pose_id = 9002 },
	{ config_id = 325009, monster_id = 21010401, pos = { x = 1290.3, y = 256.4, z = -1469.8 }, rot = { x = 0.0, y = 243.8, z = 0.0 }, level = 18, drop_tag = "远程丘丘人", pose_id = 9002 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 325001, 325002, 325003, 325004, 325005, 325006, 325007, 325008, 325009 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
