--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 600001, gadget_id = 70211111, pos = { x = 1745.6, y = 256.3, z = 518.4 }, rot = { x = 0.0, y = 216.1, z = 0.0 }, level = 18, drop_tag = "解谜中级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 600002, gadget_id = 70211101, pos = { x = 1794.1, y = 234.5, z = 539.1 }, rot = { x = 0.0, y = 263.5, z = 0.0 }, level = 18, drop_tag = "解谜低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 600003, gadget_id = 70211101, pos = { x = 1753.0, y = 234.7, z = 658.0 }, rot = { x = 0.0, y = 164.6, z = 0.0 }, level = 18, drop_tag = "解谜低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 600004, gadget_id = 70220013, pos = { x = 1798.0, y = 232.8, z = 533.6 }, rot = { x = 359.9, y = 354.0, z = 0.7 }, level = 18 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 600001, 600002, 600003, 600004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
