--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 701, monster_id = 22010101, pos = { x = 2327.0, y = 294.7, z = -156.0 }, rot = { x = 0.0, y = 58.3, z = 0.0 }, level = 1, drop_tag = "深渊法师", affix = { 1401 }, isElite = true },
	{ config_id = 702, monster_id = 21010601, pos = { x = 2333.0, y = 294.9, z = -155.6 }, rot = { x = 0.0, y = 253.2, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 703, monster_id = 21010201, pos = { x = 2332.8, y = 294.8, z = -152.2 }, rot = { x = 0.0, y = 235.5, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 704, monster_id = 21010201, pos = { x = 2329.4, y = 294.9, z = -151.6 }, rot = { x = 0.0, y = 223.4, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 705, monster_id = 21010601, pos = { x = 2330.8, y = 294.9, z = -158.1 }, rot = { x = 0.0, y = 359.9, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 1443, gadget_id = 70300107, pos = { x = 2330.9, y = 294.9, z = -154.4 }, rot = { x = 0.0, y = 323.7, z = 0.0 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 1444, gadget_id = 70220013, pos = { x = 2334.7, y = 294.5, z = -161.0 }, rot = { x = 0.0, y = 71.3, z = 0.0 }, level = 1 },
	{ config_id = 1445, gadget_id = 70220013, pos = { x = 2340.0, y = 294.9, z = -158.4 }, rot = { x = 0.0, y = 329.2, z = 0.0 }, level = 1 },
	{ config_id = 1506, gadget_id = 70220014, pos = { x = 2338.5, y = 294.8, z = -156.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 1507, gadget_id = 70220014, pos = { x = 2339.5, y = 294.7, z = -156.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = suite_1,
		monsters = { 701, 702, 703, 704, 705 },
		gadgets = { 1443, 1444, 1445, 1506, 1507 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
