--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 1180, monster_id = 28030305, pos = { x = 2187.6, y = 207.9, z = -960.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1182, monster_id = 28030303, pos = { x = 2188.9, y = 211.4, z = -1017.8 }, rot = { x = 0.0, y = 248.0, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1183, monster_id = 28030303, pos = { x = 2200.7, y = 211.8, z = -994.3 }, rot = { x = 0.0, y = 303.5, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1184, monster_id = 28030303, pos = { x = 2207.6, y = 211.3, z = -986.6 }, rot = { x = 0.0, y = 272.0, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1186, monster_id = 28030305, pos = { x = 2193.1, y = 211.7, z = -1013.2 }, rot = { x = 0.0, y = 299.9, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1188, monster_id = 28030305, pos = { x = 2190.4, y = 211.7, z = -1015.4 }, rot = { x = 0.0, y = 329.9, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1190, monster_id = 28030301, pos = { x = 2187.6, y = 209.3, z = -1054.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1192, monster_id = 28030301, pos = { x = 2186.7, y = 209.4, z = -1053.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1194, monster_id = 28030301, pos = { x = 2187.4, y = 209.2, z = -1056.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1216, monster_id = 28030301, pos = { x = 2190.5, y = 211.7, z = -1013.5 }, rot = { x = 0.0, y = 199.9, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1217, monster_id = 28030304, pos = { x = 2189.2, y = 211.8, z = -1013.6 }, rot = { x = 0.0, y = 82.8, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1218, monster_id = 28030301, pos = { x = 2189.9, y = 211.8, z = -1012.3 }, rot = { x = 0.0, y = 95.4, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 1219, monster_id = 28030301, pos = { x = 2192.4, y = 211.8, z = -1015.4 }, rot = { x = 0.0, y = 21.6, z = 0.0 }, level = 1, drop_tag = "鸟类" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 1180, 1182, 1183, 1184, 1186, 1188, 1190, 1192, 1194, 1216, 1217, 1218, 1219 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
