--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 442001, monster_id = 21010101, pos = { x = 304.5, y = 232.7, z = 1083.8 }, rot = { x = 0.0, y = 338.3, z = 0.0 }, level = 19, drop_tag = "丘丘人", pose_id = 9016 },
	{ config_id = 442002, monster_id = 21010101, pos = { x = 352.1, y = 230.6, z = 1070.0 }, rot = { x = 0.0, y = 106.7, z = 0.0 }, level = 19, drop_tag = "丘丘人", pose_id = 9016 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 442003, gadget_id = 70210101, pos = { x = 303.1, y = 233.6, z = 1085.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "搜刮点解谜人文璃月", type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 442004, gadget_id = 70210101, pos = { x = 355.2, y = 231.0, z = 1069.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "搜刮点解谜人文璃月", type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 442005, gadget_id = 70210101, pos = { x = 338.9, y = 232.3, z = 1032.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "搜刮点解谜人文璃月", type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 442006, gadget_id = 70210101, pos = { x = 319.7, y = 232.8, z = 1047.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "搜刮点解谜人文璃月", type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 442001, 442002 },
		gadgets = { 442003, 442004, 442005, 442006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
