--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 813001, gadget_id = 70290010, pos = { x = 447.8, y = 217.5, z = 1058.4 }, rot = { x = 323.1, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 813002, gadget_id = 70500000, pos = { x = 447.8, y = 217.5, z = 1058.4 }, rot = { x = 323.1, y = 0.0, z = 0.0 }, level = 19, point_type = 3006, owner = 813001 },
	{ config_id = 813003, gadget_id = 70290016, pos = { x = 358.4, y = 231.9, z = 1077.1 }, rot = { x = 338.7, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 813004, gadget_id = 70500000, pos = { x = 358.4, y = 231.9, z = 1077.1 }, rot = { x = 338.7, y = 0.0, z = 0.0 }, level = 19, point_type = 3010, owner = 813003 },
	{ config_id = 813005, gadget_id = 70290016, pos = { x = 311.1, y = 245.5, z = 1099.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 813006, gadget_id = 70500000, pos = { x = 311.1, y = 245.5, z = 1099.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, point_type = 3010, owner = 813005 },
	{ config_id = 813007, gadget_id = 70290016, pos = { x = 304.3, y = 251.6, z = 1139.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24 },
	{ config_id = 813008, gadget_id = 70500000, pos = { x = 304.3, y = 251.6, z = 1139.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, point_type = 3010, owner = 813007 },
	{ config_id = 813009, gadget_id = 70290016, pos = { x = 316.7, y = 261.1, z = 1172.6 }, rot = { x = 351.4, y = 6.9, z = 349.5 }, level = 24 },
	{ config_id = 813010, gadget_id = 70500000, pos = { x = 316.7, y = 261.1, z = 1172.6 }, rot = { x = 351.4, y = 6.9, z = 349.5 }, level = 24, point_type = 3010, owner = 813009 },
	{ config_id = 813011, gadget_id = 70290016, pos = { x = 309.9, y = 262.3, z = 1227.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24 },
	{ config_id = 813012, gadget_id = 70500000, pos = { x = 309.9, y = 262.3, z = 1227.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, point_type = 3010, owner = 813011 },
	{ config_id = 813013, gadget_id = 70290016, pos = { x = 328.0, y = 260.0, z = 1276.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24 },
	{ config_id = 813014, gadget_id = 70500000, pos = { x = 328.0, y = 260.0, z = 1276.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, point_type = 3010, owner = 813013 },
	{ config_id = 813015, gadget_id = 70290016, pos = { x = 399.9, y = 273.1, z = 1340.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24 },
	{ config_id = 813016, gadget_id = 70500000, pos = { x = 399.9, y = 273.1, z = 1340.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, point_type = 3010, owner = 813015 },
	{ config_id = 813017, gadget_id = 70290016, pos = { x = 404.7, y = 234.5, z = 1080.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 813018, gadget_id = 70500000, pos = { x = 404.7, y = 234.5, z = 1080.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, point_type = 3010, owner = 813017 },
	{ config_id = 813019, gadget_id = 70290016, pos = { x = 415.2, y = 276.8, z = 1196.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24 },
	{ config_id = 813020, gadget_id = 70500000, pos = { x = 415.2, y = 276.8, z = 1196.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, point_type = 3010, owner = 813019 },
	{ config_id = 813021, gadget_id = 70290008, pos = { x = 460.9, y = 233.1, z = 1054.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 813022, gadget_id = 70500000, pos = { x = 460.9, y = 233.1, z = 1054.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, point_type = 3008, owner = 813021 },
	{ config_id = 813023, gadget_id = 70290001, pos = { x = 312.7, y = 258.4, z = 1084.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 813024, gadget_id = 70500000, pos = { x = 312.7, y = 259.0, z = 1084.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, point_type = 3002, owner = 813023 },
	{ config_id = 813025, gadget_id = 70500000, pos = { x = 312.6, y = 259.3, z = 1083.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, point_type = 3002, owner = 813023 },
	{ config_id = 813026, gadget_id = 70500000, pos = { x = 313.0, y = 259.7, z = 1083.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, point_type = 3002, owner = 813023 },
	{ config_id = 813027, gadget_id = 70290010, pos = { x = 483.8, y = 233.0, z = 1121.9 }, rot = { x = 351.3, y = 0.1, z = 358.1 }, level = 24 },
	{ config_id = 813028, gadget_id = 70500000, pos = { x = 483.8, y = 233.0, z = 1121.9 }, rot = { x = 351.3, y = 0.1, z = 358.1 }, level = 24, point_type = 3006, owner = 813027 },
	{ config_id = 813029, gadget_id = 70290010, pos = { x = 497.1, y = 247.7, z = 1211.7 }, rot = { x = 357.0, y = 0.1, z = 357.4 }, level = 24 },
	{ config_id = 813030, gadget_id = 70500000, pos = { x = 497.1, y = 247.7, z = 1211.7 }, rot = { x = 357.0, y = 0.1, z = 357.4 }, level = 24, point_type = 3006, owner = 813029 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 813001, 813002, 813003, 813004, 813005, 813006, 813007, 813008, 813009, 813010, 813011, 813012, 813013, 813014, 813015, 813016, 813017, 813018, 813019, 813020, 813021, 813022, 813023, 813024, 813025, 813026, 813027, 813028, 813029, 813030 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
