--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 387002, monster_id = 21010101, pos = { x = 1368.2, y = 204.6, z = 647.2 }, rot = { x = 0.0, y = 155.3, z = 0.0 }, level = 18, drop_tag = "丘丘人", disableWander = true, pose_id = 9016 },
	{ config_id = 387003, monster_id = 21010101, pos = { x = 1366.5, y = 205.0, z = 645.2 }, rot = { x = 0.0, y = 106.1, z = 0.0 }, level = 18, drop_tag = "丘丘人", disableWander = true, pose_id = 9016 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 387001, gadget_id = 70211101, pos = { x = 1369.0, y = 205.4, z = 645.4 }, rot = { x = 18.8, y = 300.9, z = 330.5 }, level = 1, drop_tag = "解谜低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 387005, gadget_id = 70211101, pos = { x = 1350.2, y = 200.5, z = 670.7 }, rot = { x = 9.0, y = 347.0, z = 3.4 }, level = 1, drop_tag = "解谜低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 387002, 387003 },
		gadgets = { 387001, 387005 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
