--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 257, gadget_id = 70220013, pos = { x = 685.6, y = 237.8, z = -208.1 }, rot = { x = 0.0, y = 23.4, z = 0.0 }, level = 25 },
	{ config_id = 259, gadget_id = 70220014, pos = { x = 681.0, y = 237.6, z = -219.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 260, gadget_id = 70220013, pos = { x = 676.9, y = 233.7, z = -242.0 }, rot = { x = 353.1, y = 19.2, z = 19.0 }, level = 25 },
	{ config_id = 262, gadget_id = 70220013, pos = { x = 684.6, y = 234.5, z = -273.2 }, rot = { x = 0.0, y = 337.1, z = 0.0 }, level = 25 },
	{ config_id = 263, gadget_id = 70220014, pos = { x = 689.8, y = 234.2, z = -281.1 }, rot = { x = 2.6, y = 0.3, z = 13.7 }, level = 25 },
	{ config_id = 264, gadget_id = 70220014, pos = { x = 685.1, y = 234.5, z = -275.1 }, rot = { x = 357.0, y = 359.6, z = 14.0 }, level = 25 },
	{ config_id = 265, gadget_id = 70220014, pos = { x = 678.7, y = 247.7, z = -283.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 266, gadget_id = 70220014, pos = { x = 677.4, y = 247.9, z = -284.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 281, gadget_id = 70220014, pos = { x = 573.1, y = 206.3, z = -105.8 }, rot = { x = 8.4, y = 358.6, z = 341.0 }, level = 19 },
	{ config_id = 282, gadget_id = 70220013, pos = { x = 575.6, y = 205.8, z = -103.1 }, rot = { x = 351.4, y = 265.2, z = 3.9 }, level = 19 },
	{ config_id = 283, gadget_id = 70220013, pos = { x = 573.5, y = 206.0, z = -103.8 }, rot = { x = 354.8, y = 265.3, z = 4.3 }, level = 19 },
	{ config_id = 340, gadget_id = 70220013, pos = { x = 1085.1, y = 201.7, z = 23.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 341, gadget_id = 70220014, pos = { x = 1085.5, y = 201.6, z = 25.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 342, gadget_id = 70220014, pos = { x = 1081.1, y = 201.9, z = 24.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 343, gadget_id = 70220014, pos = { x = 1080.9, y = 201.4, z = 34.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 344, gadget_id = 70220013, pos = { x = 1084.1, y = 201.4, z = 30.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 384, gadget_id = 70220014, pos = { x = 631.6, y = 223.4, z = -448.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 385, gadget_id = 70220013, pos = { x = 633.6, y = 223.4, z = -450.0 }, rot = { x = 0.0, y = 265.5, z = 0.0 }, level = 19 },
	{ config_id = 390, gadget_id = 70220014, pos = { x = 755.3, y = 238.9, z = -267.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 391, gadget_id = 70220014, pos = { x = 744.7, y = 239.0, z = -265.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 392, gadget_id = 70220013, pos = { x = 743.6, y = 239.0, z = -264.3 }, rot = { x = 0.0, y = 22.7, z = 0.0 }, level = 25 },
	{ config_id = 394, gadget_id = 70220014, pos = { x = 865.8, y = 258.5, z = -331.2 }, rot = { x = 3.0, y = 0.1, z = 2.2 }, level = 25 },
	{ config_id = 413, gadget_id = 70220014, pos = { x = 366.3, y = 199.6, z = -142.1 }, rot = { x = 51.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 414, gadget_id = 70220014, pos = { x = 380.8, y = 199.7, z = -136.4 }, rot = { x = 281.5, y = 266.3, z = 0.0 }, level = 19 },
	{ config_id = 415, gadget_id = 70220014, pos = { x = 362.3, y = 200.2, z = -131.3 }, rot = { x = 296.7, y = 280.4, z = 0.0 }, level = 19 },
	{ config_id = 416, gadget_id = 70220014, pos = { x = 380.3, y = 199.4, z = -138.0 }, rot = { x = 21.3, y = 228.0, z = 0.0 }, level = 19 },
	{ config_id = 417, gadget_id = 70220013, pos = { x = 357.4, y = 199.1, z = -135.0 }, rot = { x = 353.1, y = 19.2, z = 19.0 }, level = 19 },
	{ config_id = 418, gadget_id = 70220013, pos = { x = 381.5, y = 198.9, z = -137.9 }, rot = { x = 353.1, y = 177.6, z = 19.0 }, level = 19 },
	{ config_id = 421, gadget_id = 70220014, pos = { x = 399.1, y = 202.1, z = -62.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 422, gadget_id = 70220014, pos = { x = 398.3, y = 202.0, z = -63.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 423, gadget_id = 70220014, pos = { x = 439.4, y = 201.1, z = -80.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 424, gadget_id = 70220014, pos = { x = 434.6, y = 201.5, z = -73.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 425, gadget_id = 70220014, pos = { x = 443.1, y = 206.6, z = -36.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 426, gadget_id = 70220014, pos = { x = 428.7, y = 208.0, z = -19.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 427, gadget_id = 70220014, pos = { x = 480.5, y = 200.4, z = -47.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 428, gadget_id = 70220014, pos = { x = 477.7, y = 201.1, z = -31.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 429, gadget_id = 70220014, pos = { x = 419.9, y = 201.6, z = -75.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 430, gadget_id = 70220013, pos = { x = 420.3, y = 201.6, z = -74.0 }, rot = { x = 0.0, y = 22.7, z = 0.0 }, level = 19 },
	{ config_id = 431, gadget_id = 70220013, pos = { x = 430.3, y = 208.0, z = -19.7 }, rot = { x = 0.0, y = 357.0, z = 0.0 }, level = 19 },
	{ config_id = 432, gadget_id = 70220013, pos = { x = 478.9, y = 201.2, z = -30.1 }, rot = { x = 0.0, y = 22.7, z = 0.0 }, level = 19 },
	{ config_id = 433, gadget_id = 70220013, pos = { x = 437.5, y = 201.2, z = -75.3 }, rot = { x = 0.0, y = 22.7, z = 0.0 }, level = 19 },
	{ config_id = 434, gadget_id = 70220013, pos = { x = 436.6, y = 202.3, z = -56.9 }, rot = { x = 0.0, y = 30.4, z = 0.0 }, level = 19 },
	{ config_id = 435, gadget_id = 70220013, pos = { x = 434.8, y = 202.6, z = -56.0 }, rot = { x = 0.0, y = 352.5, z = 0.0 }, level = 19 },
	{ config_id = 106001, gadget_id = 70220014, pos = { x = 738.7, y = 247.6, z = -279.0 }, rot = { x = 2.7, y = 0.1, z = 2.7 }, level = 25 },
	{ config_id = 106002, gadget_id = 70220014, pos = { x = 737.7, y = 247.6, z = -279.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 106003, gadget_id = 70220013, pos = { x = 839.0, y = 206.0, z = -41.9 }, rot = { x = 354.5, y = 266.2, z = 352.9 }, level = 25 },
	{ config_id = 106004, gadget_id = 70220014, pos = { x = 839.1, y = 205.8, z = -40.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 106005, gadget_id = 70220014, pos = { x = 816.4, y = 241.2, z = -251.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 25 },
	{ config_id = 106006, gadget_id = 70220013, pos = { x = 816.1, y = 241.2, z = -250.1 }, rot = { x = 351.9, y = 3.3, z = 1.3 }, level = 25 },
	{ config_id = 106007, gadget_id = 70220013, pos = { x = 850.7, y = 253.0, z = -283.8 }, rot = { x = 3.5, y = 23.1, z = 12.0 }, level = 25 },
	{ config_id = 106008, gadget_id = 70220013, pos = { x = 681.6, y = 262.3, z = -102.7 }, rot = { x = 3.5, y = 20.8, z = 357.9 }, level = 25 },
	{ config_id = 106009, gadget_id = 70220014, pos = { x = 682.7, y = 262.1, z = -101.2 }, rot = { x = 2.5, y = 359.8, z = 356.7 }, level = 19 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 257, 259, 260, 262, 263, 264, 265, 266, 281, 282, 283, 340, 341, 342, 343, 344, 384, 385, 390, 391, 392, 394, 413, 414, 415, 416, 417, 418, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 106001, 106002, 106005, 106006, 106007, 106008, 106009 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
