--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 101, monster_id = 20011101, pos = { x = 2610.7, y = 230.9, z = 102.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 30, drop_tag = "史莱姆" },
	{ config_id = 102, monster_id = 20010901, pos = { x = 2619.4, y = 229.7, z = 88.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 30, drop_tag = "史莱姆" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 923, gadget_id = 70211131, pos = { x = 2652.4, y = 325.1, z = 132.1 }, rot = { x = 0.0, y = 166.1, z = 0.0 }, level = 23, drop_tag = "解谜超级蒙德", isOneoff = true, persistent = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 924, gadget_id = 70211111, pos = { x = 2699.9, y = 226.6, z = 84.9 }, rot = { x = 0.0, y = 38.0, z = 0.0 }, level = 23, drop_tag = "解谜中级蒙德", isOneoff = true, persistent = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 101, 102 },
		gadgets = { 923 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
