--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 431001, gadget_id = 70220013, pos = { x = 13.4, y = 211.8, z = 762.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 431002, gadget_id = 70220013, pos = { x = 18.6, y = 212.1, z = 756.6 }, rot = { x = 8.0, y = 0.2, z = 2.7 }, level = 19 },
	{ config_id = 431003, gadget_id = 70220013, pos = { x = 20.0, y = 211.8, z = 778.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 431004, gadget_id = 70211101, pos = { x = 15.0, y = 212.2, z = 766.3 }, rot = { x = 0.0, y = 79.0, z = 0.0 }, level = 19, drop_tag = "解谜低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 431005, gadget_id = 70211101, pos = { x = 19.4, y = 212.2, z = 773.8 }, rot = { x = 0.0, y = 160.7, z = 0.0 }, level = 19, drop_tag = "解谜低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 431001, 431002, 431003, 431004, 431005 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
