--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 310001, monster_id = 22010101, pos = { x = 724.9, y = 246.9, z = 1596.6 }, rot = { x = 0.0, y = 21.1, z = 0.0 }, level = 1, drop_tag = "深渊法师", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 310002, monster_id = 21030401, pos = { x = 727.5, y = 247.1, z = 1598.6 }, rot = { x = 0.0, y = 280.4, z = 0.0 }, level = 1, drop_tag = "丘丘萨满", affix = { 1401 }, isElite = true, pose_id = 9012 },
	{ config_id = 310003, monster_id = 21010201, pos = { x = 731.2, y = 248.2, z = 1598.8 }, rot = { x = 0.0, y = 274.4, z = 0.0 }, level = 1, drop_tag = "丘丘人" },
	{ config_id = 310004, monster_id = 21010201, pos = { x = 726.7, y = 247.0, z = 1603.8 }, rot = { x = 0.0, y = 95.7, z = 0.0 }, level = 1, drop_tag = "丘丘人", pose_id = 0 },
	{ config_id = 310005, monster_id = 21010601, pos = { x = 723.9, y = 246.3, z = 1597.9 }, rot = { x = 0.0, y = 78.1, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1408 }, isElite = true },
	{ config_id = 310006, monster_id = 21011001, pos = { x = 721.5, y = 250.0, z = 1599.2 }, rot = { x = 0.0, y = 356.3, z = 0.0 }, level = 1, drop_tag = "远程丘丘人", affix = { 1409 }, isElite = true, pose_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 310007, gadget_id = 70300107, pos = { x = 725.7, y = 246.6, z = 1598.4 }, rot = { x = 0.0, y = 304.2, z = 0.0 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 310008, gadget_id = 70220013, pos = { x = 723.1, y = 247.2, z = 1592.1 }, rot = { x = 357.8, y = 358.1, z = 355.8 }, level = 1 },
	{ config_id = 310009, gadget_id = 70220013, pos = { x = 728.3, y = 247.7, z = 1593.8 }, rot = { x = 12.5, y = 260.8, z = 350.8 }, level = 1 },
	{ config_id = 310010, gadget_id = 70220014, pos = { x = 715.4, y = 245.6, z = 1598.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 310011, gadget_id = 70300086, pos = { x = 725.6, y = 247.5, z = 1593.1 }, rot = { x = 0.0, y = 265.8, z = 0.0 }, level = 1 },
	{ config_id = 310012, gadget_id = 70220014, pos = { x = 714.5, y = 245.6, z = 1597.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = suite_1,
		monsters = { 310001, 310002, 310003, 310004, 310005, 310006 },
		gadgets = { 310007, 310008, 310009, 310010, 310011, 310012 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
