--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 35002, monster_id = 21010101, pos = { x = -131.0, y = 200.7, z = -850.4 }, rot = { x = 0.0, y = 230.6, z = 0.0 }, level = 32, drop_tag = "丘丘人", pose_id = 9011 },
	{ config_id = 35005, monster_id = 21010201, pos = { x = -99.7, y = 200.2, z = -860.9 }, rot = { x = 357.7, y = 150.8, z = 1.3 }, level = 32, drop_tag = "丘丘人", pose_id = 9015 },
	{ config_id = 35006, monster_id = 21010301, pos = { x = -102.3, y = 200.5, z = -861.8 }, rot = { x = 359.9, y = 135.7, z = 8.8 }, level = 32, drop_tag = "丘丘人", pose_id = 9015 },
	{ config_id = 35007, monster_id = 21010701, pos = { x = -140.1, y = 200.9, z = -897.8 }, rot = { x = 0.0, y = 19.3, z = 0.0 }, level = 32, drop_tag = "丘丘人" },
	{ config_id = 35008, monster_id = 21010401, pos = { x = -123.6, y = 201.3, z = -872.8 }, rot = { x = 0.0, y = 22.9, z = 0.0 }, level = 32, drop_tag = "远程丘丘人", pose_id = 402 },
	{ config_id = 35009, monster_id = 21010601, pos = { x = -128.1, y = 203.5, z = -890.5 }, rot = { x = 0.0, y = 97.8, z = 0.0 }, level = 32, drop_tag = "丘丘人", pose_id = 9011 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 35001, gadget_id = 70310006, pos = { x = -132.0, y = 200.8, z = -851.6 }, rot = { x = 3.8, y = 3.8, z = 358.1 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 35003, gadget_id = 70310001, pos = { x = -120.9, y = 201.3, z = -871.3 }, rot = { x = 357.7, y = 100.1, z = 8.4 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 35004, gadget_id = 70310001, pos = { x = -127.7, y = 200.8, z = -868.5 }, rot = { x = 358.2, y = 260.2, z = 0.3 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 35010, gadget_id = 70220035, pos = { x = -127.0, y = 203.6, z = -890.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 35011, gadget_id = 70220035, pos = { x = -150.1, y = 201.0, z = -892.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 35002, 35005, 35006, 35007, 35008, 35009 },
		gadgets = { 35001, 35003, 35004, 35010, 35011 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
