--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 1150, gadget_id = 70210101, pos = { x = 2004.5, y = 207.1, z = -838.1 }, rot = { x = 0.0, y = 169.3, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1151, gadget_id = 70210101, pos = { x = 1860.2, y = 239.9, z = -856.5 }, rot = { x = 0.0, y = 87.5, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1152, gadget_id = 70210101, pos = { x = 1876.6, y = 240.0, z = -872.0 }, rot = { x = 0.0, y = 61.2, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1154, gadget_id = 70210101, pos = { x = 1932.4, y = 229.6, z = -360.3 }, rot = { x = 0.0, y = 20.7, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1155, gadget_id = 70210101, pos = { x = 1968.9, y = 221.8, z = -580.6 }, rot = { x = 0.0, y = 153.0, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1156, gadget_id = 70210101, pos = { x = 1933.8, y = 225.9, z = -564.3 }, rot = { x = 0.0, y = 179.2, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1157, gadget_id = 70210101, pos = { x = 1948.0, y = 220.4, z = -560.6 }, rot = { x = 0.0, y = 208.3, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1159, gadget_id = 70210101, pos = { x = 1709.0, y = 206.7, z = -461.0 }, rot = { x = 0.0, y = 258.8, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1160, gadget_id = 70210101, pos = { x = 1770.8, y = 218.2, z = -459.1 }, rot = { x = 0.0, y = 345.7, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1215, gadget_id = 70210101, pos = { x = 1671.3, y = 208.3, z = -403.5 }, rot = { x = 0.0, y = 86.2, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1304, gadget_id = 70210101, pos = { x = 1729.4, y = 227.4, z = -578.9 }, rot = { x = 0.0, y = 86.2, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1908, gadget_id = 70210101, pos = { x = 1921.6, y = 210.4, z = -708.1 }, rot = { x = 0.0, y = 169.3, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 1909, gadget_id = 70210101, pos = { x = 1924.6, y = 210.7, z = -706.1 }, rot = { x = 0.0, y = 169.3, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 2124, gadget_id = 70210101, pos = { x = 1945.9, y = 219.7, z = -566.2 }, rot = { x = 0.0, y = 153.0, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 2125, gadget_id = 70210101, pos = { x = 1930.3, y = 212.8, z = -680.5 }, rot = { x = 0.0, y = 153.0, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 2136, gadget_id = 70210101, pos = { x = 1878.2, y = 225.7, z = -416.8 }, rot = { x = 0.0, y = 153.0, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 2137, gadget_id = 70210101, pos = { x = 1797.0, y = 219.6, z = -381.4 }, rot = { x = 0.0, y = 153.0, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 2138, gadget_id = 70210101, pos = { x = 1833.7, y = 220.7, z = -426.7 }, rot = { x = 0.0, y = 153.0, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" },
	{ config_id = 2139, gadget_id = 70210101, pos = { x = 1700.4, y = 206.5, z = -465.4 }, rot = { x = 0.0, y = 345.7, z = 0.0 }, level = 10, drop_tag = "搜刮点解谜通用蒙德" }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 1150, 1151, 1152, 1154, 1155, 1156, 1157, 1159, 1160, 1215, 1304, 1908, 1909, 2124, 2125, 2136, 2137, 2138, 2139 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
