--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 561001, monster_id = 22010201, pos = { x = 1109.4, y = 200.4, z = 286.5 }, rot = { x = 356.8, y = 56.3, z = 0.0 }, level = 1, drop_tag = "深渊法师", affix = { 1403, 1408 }, isElite = true, pose_id = 9013 },
	{ config_id = 561002, monster_id = 21010601, pos = { x = 1112.9, y = 200.9, z = 295.5 }, rot = { x = 3.1, y = 251.2, z = 0.8 }, level = 1, drop_tag = "丘丘人", affix = { 1403, 1408 }, isElite = true, pose_id = 9012 },
	{ config_id = 561003, monster_id = 21010201, pos = { x = 1116.1, y = 200.9, z = 291.2 }, rot = { x = 3.2, y = 233.5, z = 359.8 }, level = 1, drop_tag = "丘丘人", affix = { 1403, 1408 }, isElite = true, pose_id = 9012 },
	{ config_id = 561004, monster_id = 21010201, pos = { x = 1114.5, y = 200.8, z = 287.9 }, rot = { x = 1.4, y = 301.2, z = 2.9 }, level = 1, drop_tag = "丘丘人", affix = { 1403, 1408 }, isElite = true, pose_id = 9012 },
	{ config_id = 561005, monster_id = 21010601, pos = { x = 1114.6, y = 201.0, z = 293.5 }, rot = { x = 3.1, y = 253.4, z = 0.9 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true, pose_id = 9012 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 561006, gadget_id = 70300107, pos = { x = 1111.9, y = 200.7, z = 290.5 }, rot = { x = 0.3, y = 321.7, z = 3.2 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 561007, gadget_id = 70220013, pos = { x = 1106.6, y = 200.0, z = 283.3 }, rot = { x = 353.3, y = 68.9, z = 2.6 }, level = 1 },
	{ config_id = 561008, gadget_id = 70220013, pos = { x = 1113.5, y = 200.4, z = 281.2 }, rot = { x = 3.9, y = 327.0, z = 6.0 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = suite_1,
		monsters = { 561001, 561002, 561003, 561004, 561005 },
		gadgets = { 561006, 561007, 561008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
