--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 143001, monster_id = 28020102, pos = { x = 1436.5, y = 221.6, z = 1150.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 143002, monster_id = 28020102, pos = { x = 1435.2, y = 223.6, z = 1159.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 143003, monster_id = 28020102, pos = { x = 1451.2, y = 222.8, z = 1170.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 143004, monster_id = 28030101, pos = { x = 1444.9, y = 220.4, z = 1148.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 143005, monster_id = 28030101, pos = { x = 1439.4, y = 222.3, z = 1157.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 143006, monster_id = 28030101, pos = { x = 1449.2, y = 222.2, z = 1166.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 143007, monster_id = 28030402, pos = { x = 1447.8, y = 220.3, z = 1150.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 143008, monster_id = 28030402, pos = { x = 1442.6, y = 221.7, z = 1156.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 143009, monster_id = 28030402, pos = { x = 1437.3, y = 224.4, z = 1170.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 143010, monster_id = 28030402, pos = { x = 1428.4, y = 224.1, z = 1156.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 143011, monster_id = 28030402, pos = { x = 1456.7, y = 221.9, z = 1162.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 143012, monster_id = 28030402, pos = { x = 1445.4, y = 220.7, z = 1154.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 143013, monster_id = 28030402, pos = { x = 1430.9, y = 222.3, z = 1147.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类", pose_id = 901 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 143001, 143002, 143003, 143004, 143005, 143006, 143007, 143008, 143009, 143010, 143011, 143012, 143013 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
