--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 3001, monster_id = 25010201, pos = { x = -495.2, y = 225.2, z = 791.3 }, rot = { x = 0.0, y = 194.6, z = 0.0 }, level = 28, drop_id = 1000100 },
	{ config_id = 3002, monster_id = 25010201, pos = { x = -499.3, y = 225.3, z = 790.5 }, rot = { x = 0.0, y = 198.4, z = 0.0 }, level = 28, drop_id = 1000100 },
	{ config_id = 3003, monster_id = 25020201, pos = { x = -497.7, y = 225.2, z = 790.7 }, rot = { x = 0.0, y = 177.8, z = 0.0 }, level = 29, drop_id = 1000100 },
	{ config_id = 3004, monster_id = 25020201, pos = { x = -488.5, y = 225.2, z = 798.2 }, rot = { x = 0.0, y = 13.4, z = 0.0 }, level = 28, drop_id = 1000100 },
	{ config_id = 3005, monster_id = 25010201, pos = { x = -470.2, y = 225.1, z = 803.4 }, rot = { x = 0.0, y = 50.7, z = 0.0 }, level = 28, drop_id = 1000100 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100,
		ban_refresh = true
	},
	{
		-- suite_id = 2,
		-- description = suite_2,
		monsters = { 3001, 3002, 3003, 3004, 3005 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100,
		ban_refresh = true
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
