--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 43001, gadget_id = 70220014, pos = { x = -906.9, y = 228.0, z = 667.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 43002, gadget_id = 70220014, pos = { x = -905.9, y = 228.0, z = 667.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 43003, gadget_id = 70220014, pos = { x = -906.6, y = 228.0, z = 668.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 43004, gadget_id = 70220014, pos = { x = -909.7, y = 224.5, z = 696.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 43005, gadget_id = 70220014, pos = { x = -908.5, y = 224.6, z = 696.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 43006, gadget_id = 70220014, pos = { x = -907.6, y = 224.5, z = 697.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 43007, gadget_id = 70211001, pos = { x = -906.7, y = 228.0, z = 671.9 }, rot = { x = 0.0, y = 152.0, z = 0.0 }, level = 32, drop_tag = "战斗低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 43008, gadget_id = 70211001, pos = { x = -923.0, y = 237.0, z = 675.2 }, rot = { x = 0.0, y = 160.0, z = 0.0 }, level = 32, drop_tag = "战斗低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 43001, 43002, 43003, 43004, 43005, 43006, 43007, 43008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
