--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 108001, gadget_id = 70500000, pos = { x = 1404.2, y = 212.2, z = 1021.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, point_type = 4002, isOneoff = true, persistent = true },
	{ config_id = 108002, gadget_id = 70500000, pos = { x = 1607.1, y = 207.0, z = 1143.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, point_type = 4002, isOneoff = true, persistent = true },
	{ config_id = 108003, gadget_id = 70500000, pos = { x = 1393.9, y = 233.3, z = 1245.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, point_type = 4002, isOneoff = true, persistent = true },
	{ config_id = 108004, gadget_id = 70500000, pos = { x = 1442.9, y = 255.5, z = 1296.5 }, rot = { x = 0.0, y = 291.4, z = 0.0 }, level = 19, point_type = 4002, isOneoff = true, persistent = true }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 108001, 108002, 108003, 108004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
