--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 509, monster_id = 28020301, pos = { x = 1207.2, y = 255.1, z = -1486.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 510, monster_id = 28030401, pos = { x = 1188.9, y = 261.2, z = -1505.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 511, monster_id = 28030401, pos = { x = 1190.1, y = 261.2, z = -1497.6 }, rot = { x = 0.0, y = 208.3, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 512, monster_id = 28030401, pos = { x = 1188.7, y = 260.0, z = -1516.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 513, monster_id = 28030401, pos = { x = 1196.1, y = 259.9, z = -1503.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 514, monster_id = 28030401, pos = { x = 1191.4, y = 261.8, z = -1504.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 545, monster_id = 28030401, pos = { x = 1227.7, y = 257.7, z = -1533.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 546, monster_id = 28030401, pos = { x = 1230.5, y = 257.8, z = -1534.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 547, monster_id = 28030401, pos = { x = 1229.4, y = 257.5, z = -1529.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 548, monster_id = 28030401, pos = { x = 1226.9, y = 257.6, z = -1531.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 550, monster_id = 28020201, pos = { x = 1216.0, y = 257.0, z = -1426.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 551, monster_id = 28020102, pos = { x = 1214.2, y = 257.5, z = -1437.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "走兽" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 509, 511, 513, 545, 547, 550, 551 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
