--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 633, monster_id = 20011401, pos = { x = 2520.9, y = 253.2, z = -320.6 }, rot = { x = 0.0, y = 143.4, z = 0.0 }, level = 18, drop_tag = "史莱姆" },
	{ config_id = 634, monster_id = 20011401, pos = { x = 2520.2, y = 253.1, z = -322.6 }, rot = { x = 0.0, y = 124.1, z = 0.0 }, level = 18, drop_tag = "史莱姆" },
	{ config_id = 635, monster_id = 20011401, pos = { x = 2523.4, y = 252.9, z = -320.1 }, rot = { x = 0.0, y = 216.7, z = 0.0 }, level = 18, drop_tag = "史莱姆" },
	{ config_id = 636, monster_id = 20011401, pos = { x = 2523.4, y = 252.9, z = -322.7 }, rot = { x = 0.0, y = 204.5, z = 0.0 }, level = 18, drop_tag = "史莱姆" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
	{ config_id = 273, shape = RegionShape.SPHERE, radius = 3, pos = { x = 2521.8, y = 253.2, z = -321.4 } }
}

-- 触发器
triggers = {
	{ name = "ENTER_REGION_273", event = EventType.EVENT_ENTER_REGION, source = "", condition = "", action = "" }
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 633, 634, 635, 636 },
		gadgets = { },
		regions = { 273 },
		triggers = { "ENTER_REGION_273" },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================

-- 触发条件

-- 触发操作
