--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 609, monster_id = 28030301, pos = { x = 2373.8, y = 297.8, z = -1686.6 }, rot = { x = 0.0, y = 233.2, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 610, monster_id = 28030301, pos = { x = 2376.9, y = 297.8, z = -1683.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 611, monster_id = 28030301, pos = { x = 2372.2, y = 297.8, z = -1686.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 612, monster_id = 28030301, pos = { x = 2375.8, y = 297.8, z = -1680.4 }, rot = { x = 0.0, y = 218.2, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 613, monster_id = 28030301, pos = { x = 2404.3, y = 297.8, z = -1715.8 }, rot = { x = 0.0, y = 261.4, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 614, monster_id = 28030301, pos = { x = 2401.8, y = 297.8, z = -1713.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 2628, gadget_id = 70211001, pos = { x = 2415.4, y = 297.8, z = -1710.3 }, rot = { x = 0.0, y = 249.3, z = 0.0 }, level = 15, drop_tag = "战斗低级蒙德", showcutscene = true, isOneoff = true }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 609, 610, 611, 612, 613, 614 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
