--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 512001, monster_id = 21010401, pos = { x = 704.2, y = 206.3, z = 870.7 }, rot = { x = 0.0, y = 256.1, z = 0.0 }, level = 19, drop_tag = "远程丘丘人", disableWander = true, pose_id = 9012 },
	{ config_id = 512002, monster_id = 21010201, pos = { x = 700.4, y = 206.3, z = 870.4 }, rot = { x = 0.0, y = 80.9, z = 0.0 }, level = 19, drop_tag = "丘丘人", disableWander = true, pose_id = 9012 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 512003, gadget_id = 70310006, pos = { x = 702.3, y = 206.3, z = 870.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, state = GadgetState.GearStart },
	{ config_id = 512004, gadget_id = 70220013, pos = { x = 699.9, y = 206.3, z = 873.5 }, rot = { x = 0.0, y = 38.0, z = 0.0 }, level = 19 },
	{ config_id = 512005, gadget_id = 70220014, pos = { x = 702.6, y = 206.3, z = 868.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19 },
	{ config_id = 512006, gadget_id = 70500000, pos = { x = 701.7, y = 206.3, z = 871.5 }, rot = { x = 0.0, y = 203.6, z = 0.0 }, level = 19, point_type = 3003 },
	{ config_id = 512007, gadget_id = 70500000, pos = { x = 702.0, y = 206.3, z = 871.6 }, rot = { x = 0.0, y = 253.4, z = 0.0 }, level = 19, point_type = 3003 },
	{ config_id = 512008, gadget_id = 70500000, pos = { x = 702.6, y = 206.3, z = 871.5 }, rot = { x = 0.0, y = 0.0, z = 287.7 }, level = 19, point_type = 2002 },
	{ config_id = 512009, gadget_id = 70500000, pos = { x = 702.4, y = 206.6, z = 870.6 }, rot = { x = 0.7, y = 2.4, z = 32.4 }, level = 19, point_type = 9104 },
	{ config_id = 512010, gadget_id = 70500000, pos = { x = 702.2, y = 206.7, z = 870.5 }, rot = { x = 0.0, y = 111.8, z = 63.6 }, level = 19, point_type = 9104 },
	{ config_id = 512011, gadget_id = 70500000, pos = { x = 703.6, y = 206.3, z = 871.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, point_type = 2007 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 512001, 512002 },
		gadgets = { 512003, 512004, 512005, 512006, 512007, 512008, 512009, 512010, 512011 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
