--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 545001, monster_id = 28020201, pos = { x = 639.4, y = 214.8, z = 951.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 545002, monster_id = 28020201, pos = { x = 649.7, y = 220.4, z = 963.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 545003, monster_id = 28030401, pos = { x = 639.9, y = 218.2, z = 964.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 545004, monster_id = 28030401, pos = { x = 641.2, y = 219.7, z = 970.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 545005, monster_id = 28030401, pos = { x = 651.3, y = 224.0, z = 985.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 545006, monster_id = 28050102, pos = { x = 647.2, y = 225.3, z = 986.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "魔法生物" },
	{ config_id = 545007, monster_id = 28050102, pos = { x = 658.0, y = 226.1, z = 986.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "魔法生物" },
	{ config_id = 545008, monster_id = 28050102, pos = { x = 655.3, y = 228.2, z = 1000.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "魔法生物" },
	{ config_id = 545009, monster_id = 28050102, pos = { x = 671.5, y = 227.7, z = 1011.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "魔法生物" },
	{ config_id = 545010, monster_id = 28050102, pos = { x = 663.1, y = 229.3, z = 1016.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "魔法生物" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 545001, 545002, 545003, 545004, 545005, 545006, 545007, 545008, 545009, 545010 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
