--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 21001, monster_id = 20011001, pos = { x = -61.2, y = 200.1, z = -196.2 }, rot = { x = 0.0, y = 289.2, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21002, monster_id = 20011001, pos = { x = -42.2, y = 200.0, z = -174.2 }, rot = { x = 0.0, y = 341.0, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21003, monster_id = 20011001, pos = { x = -60.3, y = 199.9, z = -196.0 }, rot = { x = 0.0, y = 334.4, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21004, monster_id = 20011001, pos = { x = -45.1, y = 200.0, z = -213.4 }, rot = { x = 0.0, y = 344.4, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21006, monster_id = 20011001, pos = { x = -45.8, y = 200.0, z = -211.7 }, rot = { x = 0.0, y = 73.7, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21010, monster_id = 20011001, pos = { x = -60.9, y = 200.0, z = -245.8 }, rot = { x = 0.0, y = 21.0, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21011, monster_id = 20011001, pos = { x = -55.0, y = 200.0, z = -243.9 }, rot = { x = 0.0, y = 134.3, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21012, monster_id = 20011001, pos = { x = -113.8, y = 200.0, z = -264.0 }, rot = { x = 0.0, y = 304.6, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21013, monster_id = 20011001, pos = { x = -112.9, y = 200.0, z = -258.5 }, rot = { x = 0.0, y = 102.5, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21015, monster_id = 20011001, pos = { x = -188.2, y = 200.0, z = -220.6 }, rot = { x = 0.0, y = 265.9, z = 0.0 }, level = 18, drop_tag = "史莱姆" },
	{ config_id = 21016, monster_id = 20011001, pos = { x = -189.3, y = 200.0, z = -224.8 }, rot = { x = 0.0, y = 84.6, z = 0.0 }, level = 18, drop_tag = "史莱姆" },
	{ config_id = 21019, monster_id = 20011001, pos = { x = -159.9, y = 200.0, z = -246.6 }, rot = { x = 0.0, y = 273.5, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21020, monster_id = 20011001, pos = { x = -163.6, y = 200.0, z = -245.4 }, rot = { x = 0.0, y = 283.3, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21021, monster_id = 20011001, pos = { x = -164.0, y = 200.0, z = -186.5 }, rot = { x = 0.0, y = 49.5, z = 0.0 }, level = 18, drop_tag = "史莱姆" },
	{ config_id = 21022, monster_id = 20011001, pos = { x = -164.6, y = 200.0, z = -189.3 }, rot = { x = 0.0, y = 291.7, z = 0.0 }, level = 18, drop_tag = "史莱姆" },
	{ config_id = 21023, monster_id = 20011001, pos = { x = -162.4, y = 200.0, z = -187.7 }, rot = { x = 0.0, y = 73.4, z = 0.0 }, level = 18, drop_tag = "史莱姆" },
	{ config_id = 21025, monster_id = 20011101, pos = { x = -88.3, y = 200.4, z = -237.3 }, rot = { x = 0.0, y = 94.3, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21026, monster_id = 20011101, pos = { x = -160.3, y = 200.0, z = -243.8 }, rot = { x = 0.0, y = 287.4, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 21027, monster_id = 20011101, pos = { x = -182.3, y = 200.0, z = -221.6 }, rot = { x = 0.0, y = 287.4, z = 0.0 }, level = 18, drop_tag = "史莱姆" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 21001, 21002, 21003, 21004, 21006, 21010, 21011, 21012, 21013, 21015, 21016, 21019, 21020, 21021, 21022, 21023, 21025, 21026, 21027 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
