--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 470001, monster_id = 21010501, pos = { x = 1469.9, y = 204.6, z = 164.3 }, rot = { x = 2.6, y = 220.5, z = 346.7 }, level = 16, drop_tag = "远程丘丘人", disableWander = true, pose_id = 9003 },
	{ config_id = 470002, monster_id = 21010201, pos = { x = 1466.9, y = 204.2, z = 153.9 }, rot = { x = 0.0, y = 224.7, z = 0.0 }, level = 16, drop_tag = "丘丘人", disableWander = true, pose_id = 9003 },
	{ config_id = 470003, monster_id = 21010201, pos = { x = 1463.6, y = 203.5, z = 148.8 }, rot = { x = 0.0, y = 288.5, z = 0.0 }, level = 16, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 470004, monster_id = 21011001, pos = { x = 1475.2, y = 205.4, z = 157.3 }, rot = { x = 0.0, y = 260.6, z = 0.0 }, level = 16, drop_tag = "远程丘丘人", disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 470001, 470002, 470003, 470004 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
