--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 318001, monster_id = 20010901, pos = { x = 1611.6, y = 200.0, z = -406.0 }, rot = { x = 0.0, y = 169.4, z = 0.0 }, level = 1, drop_tag = "史莱姆", disableWander = true, affix = { 1403 }, isElite = true },
	{ config_id = 318002, monster_id = 20010801, pos = { x = 1614.5, y = 200.4, z = -410.2 }, rot = { x = 0.0, y = 112.4, z = 0.0 }, level = 1, drop_tag = "史莱姆", pose_id = 901 },
	{ config_id = 318003, monster_id = 20010801, pos = { x = 1610.8, y = 200.5, z = -411.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "史莱姆", pose_id = 901 },
	{ config_id = 318004, monster_id = 20010801, pos = { x = 1615.8, y = 200.9, z = -414.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "史莱姆", pose_id = 901 },
	{ config_id = 318005, monster_id = 20010801, pos = { x = 1618.4, y = 200.2, z = -408.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "史莱姆", pose_id = 901 },
	{ config_id = 318006, monster_id = 20010801, pos = { x = 1612.8, y = 201.2, z = -417.3 }, rot = { x = 0.0, y = 83.1, z = 0.0 }, level = 1, drop_tag = "史莱姆", pose_id = 901 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 318001, 318002, 318003, 318004, 318005, 318006 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100,
		ban_refresh = true
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
