--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 492, monster_id = 21010501, pos = { x = 2184.1, y = 260.1, z = -1738.5 }, rot = { x = 0.0, y = 234.3, z = 0.0 }, level = 10, drop_tag = "远程丘丘人", disableWander = true, pose_id = 9003 },
	{ config_id = 494, monster_id = 21010201, pos = { x = 2185.6, y = 259.0, z = -1725.9 }, rot = { x = 0.0, y = 13.0, z = 0.0 }, level = 10, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 499, monster_id = 21030201, pos = { x = 2181.2, y = 259.4, z = -1735.9 }, rot = { x = 0.0, y = 189.7, z = 0.0 }, level = 10, drop_tag = "丘丘萨满", disableWander = true },
	{ config_id = 96001, monster_id = 21010501, pos = { x = 2177.6, y = 259.8, z = -1736.6 }, rot = { x = 0.0, y = 161.4, z = 0.0 }, level = 10, drop_tag = "远程丘丘人", pose_id = 9003 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 2431, gadget_id = 70211011, pos = { x = 2192.6, y = 260.6, z = -1737.1 }, rot = { x = 5.2, y = 283.7, z = 356.5 }, level = 15, drop_tag = "战斗中级蒙德", isOneoff = true }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 492, 494, 499, 96001 },
		gadgets = { 2431 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
