--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 691, monster_id = 22010101, pos = { x = 2738.4, y = 248.2, z = -494.3 }, rot = { x = 0.0, y = 58.3, z = 0.0 }, level = 1, drop_tag = "深渊法师", affix = { 1401 }, isElite = true },
	{ config_id = 692, monster_id = 21010601, pos = { x = 2744.4, y = 249.2, z = -493.9 }, rot = { x = 0.0, y = 253.2, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 693, monster_id = 21010201, pos = { x = 2744.2, y = 249.2, z = -490.5 }, rot = { x = 0.0, y = 235.5, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 694, monster_id = 21010201, pos = { x = 2740.8, y = 248.7, z = -489.9 }, rot = { x = 0.0, y = 223.4, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 695, monster_id = 21010601, pos = { x = 2742.2, y = 248.8, z = -496.4 }, rot = { x = 0.0, y = 359.9, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 1440, gadget_id = 70300107, pos = { x = 2741.7, y = 248.8, z = -493.6 }, rot = { x = 0.0, y = 323.7, z = 0.0 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 1441, gadget_id = 70220013, pos = { x = 2742.9, y = 248.9, z = -501.1 }, rot = { x = 0.0, y = 71.3, z = 0.0 }, level = 1 },
	{ config_id = 1442, gadget_id = 70220013, pos = { x = 2748.2, y = 249.7, z = -498.5 }, rot = { x = 0.0, y = 329.2, z = 0.0 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = suite_1,
		monsters = { 691, 692, 693, 694, 695 },
		gadgets = { 1440, 1441, 1442 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
