--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 229, monster_id = 21010501, pos = { x = 2143.0, y = 232.8, z = -458.4 }, rot = { x = 0.0, y = 280.5, z = 0.0 }, level = 16, drop_tag = "远程丘丘人", disableWander = true },
	{ config_id = 230, monster_id = 21010501, pos = { x = 2138.4, y = 231.5, z = -454.1 }, rot = { x = 0.0, y = 274.3, z = 0.0 }, level = 16, drop_tag = "远程丘丘人", disableWander = true },
	{ config_id = 231, monster_id = 21010201, pos = { x = 2134.0, y = 230.6, z = -450.4 }, rot = { x = 0.0, y = 73.4, z = 0.0 }, level = 16, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 232, monster_id = 21010301, pos = { x = 2136.5, y = 230.8, z = -448.4 }, rot = { x = 0.0, y = 184.5, z = 0.0 }, level = 16, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 333, monster_id = 21010101, pos = { x = 2138.3, y = 228.1, z = -452.6 }, rot = { x = 0.0, y = 229.2, z = 0.0 }, level = 16, drop_tag = "丘丘人" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 313, gadget_id = 70220013, pos = { x = 2133.9, y = 231.0, z = -447.6 }, rot = { x = 0.0, y = 274.0, z = 13.2 }, level = 15 },
	{ config_id = 314, gadget_id = 70310004, pos = { x = 2135.4, y = 230.7, z = -449.6 }, rot = { x = 352.3, y = 314.0, z = 2.7 }, level = 15, state = GadgetState.GearStart }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 229, 230, 231, 232, 333 },
		gadgets = { 313, 314 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
