--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 49001, monster_id = 21010201, pos = { x = -680.3, y = 206.0, z = 1191.9 }, rot = { x = 0.0, y = 29.0, z = 0.0 }, level = 28, drop_id = 1000100, disableWander = true },
	{ config_id = 49002, monster_id = 21011201, pos = { x = -678.4, y = 205.8, z = 1190.8 }, rot = { x = 0.0, y = 34.7, z = 0.0 }, level = 28, drop_id = 1000100, disableWander = true, pose_id = 9010 },
	{ config_id = 49003, monster_id = 21020301, pos = { x = -686.3, y = 206.5, z = 1185.1 }, rot = { x = 5.3, y = 48.2, z = 356.5 }, level = 30, drop_tag = "丘丘暴徒" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 49003 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = suite_2,
		monsters = { 49001, 49002 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100,
		ban_refresh = true
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
