--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 484, monster_id = 21010601, pos = { x = 2178.7, y = 246.7, z = -1589.0 }, rot = { x = 0.0, y = 3.9, z = 0.0 }, level = 12, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 485, monster_id = 21010601, pos = { x = 2180.0, y = 246.4, z = -1586.6 }, rot = { x = 0.0, y = 14.4, z = 0.0 }, level = 12, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 486, monster_id = 21010601, pos = { x = 2206.6, y = 249.8, z = -1628.8 }, rot = { x = 0.0, y = 6.8, z = 0.0 }, level = 13, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 487, monster_id = 21010601, pos = { x = 2197.1, y = 249.9, z = -1627.5 }, rot = { x = 0.0, y = 30.9, z = 0.0 }, level = 13, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 711, monster_id = 21010201, pos = { x = 2176.5, y = 246.5, z = -1588.2 }, rot = { x = 0.0, y = 11.8, z = 0.0 }, level = 12, drop_tag = "丘丘人", disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 2600, gadget_id = 70211101, pos = { x = 2166.7, y = 240.3, z = -1535.0 }, rot = { x = 4.3, y = 324.5, z = 354.2 }, level = 5, drop_tag = "解谜低级蒙德", isOneoff = true }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 484, 485, 486, 487, 711 },
		gadgets = { 2600 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
