--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 249001, gadget_id = 70220014, pos = { x = 888.0, y = 215.6, z = 345.2 }, rot = { x = 0.0, y = 111.9, z = 0.0 }, level = 16 },
	{ config_id = 249002, gadget_id = 70220014, pos = { x = 885.9, y = 215.6, z = 346.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 16 },
	{ config_id = 249003, gadget_id = 70220014, pos = { x = 887.8, y = 215.6, z = 344.1 }, rot = { x = 0.0, y = 111.9, z = 0.0 }, level = 16 },
	{ config_id = 249004, gadget_id = 70220014, pos = { x = 887.1, y = 215.6, z = 344.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 16 },
	{ config_id = 249005, gadget_id = 70220014, pos = { x = 884.9, y = 215.6, z = 346.4 }, rot = { x = 0.0, y = 0.0, z = 0.5 }, level = 16 },
	{ config_id = 249006, gadget_id = 70211101, pos = { x = 885.8, y = 215.6, z = 347.3 }, rot = { x = 0.3, y = 227.4, z = 359.6 }, level = 16, drop_tag = "解谜低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 249009, gadget_id = 70210101, pos = { x = 950.7, y = 208.3, z = 325.8 }, rot = { x = 0.0, y = 269.8, z = 0.0 }, level = 16, drop_tag = "搜刮点解谜果蔬璃月", type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 249010, gadget_id = 70220014, pos = { x = 904.9, y = 212.8, z = 322.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 16 },
	{ config_id = 249011, gadget_id = 70220014, pos = { x = 905.7, y = 212.8, z = 323.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 16 },
	{ config_id = 249013, gadget_id = 70211101, pos = { x = 904.2, y = 212.8, z = 324.1 }, rot = { x = 0.4, y = 136.0, z = 0.3 }, level = 16, drop_tag = "解谜低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 249001, 249002, 249003, 249004, 249005, 249006, 249013 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
