--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 1046, monster_id = 20010801, pos = { x = 2675.0, y = 231.9, z = -1137.0 }, rot = { x = 0.0, y = 112.6, z = 0.0 }, level = 15, drop_tag = "史莱姆", disableWander = true },
	{ config_id = 1050, monster_id = 20011301, pos = { x = 2662.2, y = 238.2, z = -1123.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 15, drop_tag = "史莱姆", disableWander = true },
	{ config_id = 1051, monster_id = 20011201, pos = { x = 2665.9, y = 237.8, z = -1119.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 15, drop_tag = "史莱姆" },
	{ config_id = 1052, monster_id = 20011201, pos = { x = 2668.1, y = 237.1, z = -1124.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 15, drop_tag = "史莱姆" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3300, gadget_id = 70211101, pos = { x = 2669.4, y = 231.6, z = -1131.1 }, rot = { x = 0.0, y = 156.9, z = 357.2 }, level = 30, drop_tag = "解谜低级蒙德", isOneoff = true }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 1046, 1050, 1051, 1052 },
		gadgets = { 3300 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
