--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 437, monster_id = 21010101, pos = { x = 1166.1, y = 184.8, z = 544.1 }, rot = { x = 0.0, y = 138.5, z = 0.0 }, level = 16, drop_tag = "丘丘人", pose_id = 9016 },
	{ config_id = 438, monster_id = 21010101, pos = { x = 1160.3, y = 184.9, z = 541.9 }, rot = { x = 0.0, y = 247.3, z = 0.0 }, level = 16, drop_tag = "丘丘人", pose_id = 9016 },
	{ config_id = 439, monster_id = 21010101, pos = { x = 1167.3, y = 184.8, z = 542.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 16, drop_tag = "丘丘人", pose_id = 9016 },
	{ config_id = 440, monster_id = 21010601, pos = { x = 1171.1, y = 185.0, z = 549.7 }, rot = { x = 0.0, y = 330.4, z = 0.0 }, level = 16, drop_tag = "丘丘人", pose_id = 9016 },
	{ config_id = 441, monster_id = 21010701, pos = { x = 1173.8, y = 184.6, z = 534.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 16, drop_tag = "丘丘人" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 962, gadget_id = 70290016, pos = { x = 1169.6, y = 185.2, z = 553.2 }, rot = { x = 0.0, y = 92.3, z = 0.0 }, level = 19 },
	{ config_id = 963, gadget_id = 70500000, pos = { x = 1169.6, y = 185.2, z = 553.2 }, rot = { x = 0.0, y = 92.3, z = 0.0 }, level = 19, point_type = 3010, owner = 962 },
	{ config_id = 964, gadget_id = 70211111, pos = { x = 1167.3, y = 184.5, z = 543.1 }, rot = { x = 333.0, y = 73.6, z = 14.9 }, level = 19, drop_tag = "解谜中级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 437, 438, 439, 440, 441 },
		gadgets = { 962, 963, 964 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
