--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 449, monster_id = 21010401, pos = { x = 1495.8, y = 200.1, z = 269.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 15, drop_tag = "远程丘丘人", disableWander = true },
	{ config_id = 450, monster_id = 21010401, pos = { x = 1492.5, y = 200.0, z = 272.9 }, rot = { x = 0.0, y = 62.3, z = 0.0 }, level = 15, drop_tag = "远程丘丘人", disableWander = true, pose_id = 9003 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 973, gadget_id = 70220013, pos = { x = 1497.2, y = 200.1, z = 268.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 16 },
	{ config_id = 974, gadget_id = 70220026, pos = { x = 1493.0, y = 200.1, z = 275.0 }, rot = { x = 356.3, y = 0.2, z = 354.5 }, level = 16 },
	{ config_id = 976, gadget_id = 70211001, pos = { x = 1491.6, y = 200.0, z = 270.4 }, rot = { x = 0.0, y = 130.4, z = 0.0 }, level = 16, drop_tag = "战斗低级璃月", isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 977, gadget_id = 70220014, pos = { x = 1495.0, y = 200.1, z = 271.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 16 },
	{ config_id = 978, gadget_id = 70220014, pos = { x = 1496.1, y = 200.1, z = 271.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 16 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 449, 450 },
		gadgets = { 973, 974, 976, 977, 978 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
