--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 193, monster_id = 21010301, pos = { x = 274.8, y = 227.9, z = 384.5 }, rot = { x = 0.0, y = 337.7, z = 0.0 }, level = 19, drop_tag = "丘丘人", disableWander = true, pose_id = 9003 },
	{ config_id = 194, monster_id = 21010301, pos = { x = 274.7, y = 227.9, z = 387.1 }, rot = { x = 26.0, y = 179.0, z = 347.1 }, level = 19, drop_tag = "丘丘人", disableWander = true, pose_id = 9003 },
	{ config_id = 195, monster_id = 21010701, pos = { x = 273.4, y = 227.9, z = 385.6 }, rot = { x = 0.0, y = 77.8, z = 0.0 }, level = 19, drop_tag = "丘丘人" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 74001, gadget_id = 70310006, pos = { x = 274.3, y = 227.9, z = 385.7 }, rot = { x = 0.0, y = 313.5, z = 0.0 }, level = 19 },
	{ config_id = 74002, gadget_id = 70220013, pos = { x = 280.6, y = 228.5, z = 383.1 }, rot = { x = 349.6, y = 69.1, z = 9.6 }, level = 19 },
	{ config_id = 74003, gadget_id = 70220013, pos = { x = 277.9, y = 228.4, z = 389.9 }, rot = { x = 348.7, y = 70.4, z = 357.9 }, level = 19 },
	{ config_id = 74004, gadget_id = 70211001, pos = { x = 275.2, y = 227.9, z = 383.1 }, rot = { x = 0.0, y = 351.8, z = 0.0 }, level = 19, drop_tag = "战斗低级璃月", isOneoff = true, persistent = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 193, 194, 195 },
		gadgets = { 74001, 74002, 74003, 74004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
