--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 579, monster_id = 28020301, pos = { x = 2577.5, y = 265.3, z = -259.4 }, rot = { x = 0.0, y = 337.5, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 580, monster_id = 28020301, pos = { x = 2562.7, y = 264.0, z = -258.4 }, rot = { x = 0.0, y = 121.4, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 581, monster_id = 28020301, pos = { x = 2574.6, y = 263.3, z = -279.2 }, rot = { x = 0.0, y = 127.0, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 582, monster_id = 28020301, pos = { x = 2589.7, y = 264.2, z = -296.7 }, rot = { x = 0.0, y = 167.8, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 583, monster_id = 28020301, pos = { x = 2578.8, y = 262.6, z = -294.3 }, rot = { x = 0.0, y = 217.1, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 584, monster_id = 28020301, pos = { x = 2537.7, y = 263.4, z = -257.5 }, rot = { x = 0.0, y = 287.8, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 585, monster_id = 28020301, pos = { x = 2561.5, y = 258.3, z = -301.8 }, rot = { x = 0.0, y = 192.7, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 586, monster_id = 28020301, pos = { x = 2553.8, y = 263.1, z = -260.0 }, rot = { x = 0.0, y = 287.8, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 587, monster_id = 28020301, pos = { x = 2556.0, y = 259.4, z = -287.8 }, rot = { x = 0.0, y = 281.3, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 588, monster_id = 28020301, pos = { x = 2579.6, y = 262.1, z = -311.7 }, rot = { x = 0.0, y = 316.6, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 589, monster_id = 28020301, pos = { x = 2566.6, y = 262.7, z = -270.7 }, rot = { x = 0.0, y = 316.6, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 590, monster_id = 28020301, pos = { x = 2559.4, y = 259.8, z = -285.4 }, rot = { x = 0.0, y = 301.4, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 591, monster_id = 28020301, pos = { x = 2571.0, y = 261.9, z = -286.7 }, rot = { x = 0.0, y = 316.6, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 592, monster_id = 28020201, pos = { x = 2556.5, y = 263.2, z = -273.0 }, rot = { x = 0.0, y = 260.0, z = 0.0 }, level = 1, drop_tag = "走兽", disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
