--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 206, monster_id = 21010201, pos = { x = 2015.3, y = 204.6, z = -846.9 }, rot = { x = 0.0, y = 106.4, z = 0.0 }, level = 28, drop_tag = "丘丘人", disableWander = true, pose_id = 9011 },
	{ config_id = 207, monster_id = 21010201, pos = { x = 2014.1, y = 203.8, z = -849.7 }, rot = { x = 0.0, y = 23.4, z = 0.0 }, level = 28, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 208, monster_id = 21010201, pos = { x = 2010.6, y = 204.4, z = -845.6 }, rot = { x = 0.0, y = 127.4, z = 0.0 }, level = 28, drop_tag = "丘丘人", disableWander = true, pose_id = 9010 },
	{ config_id = 938, monster_id = 21010601, pos = { x = 2012.2, y = 204.7, z = -842.5 }, rot = { x = 0.0, y = 153.1, z = 0.0 }, level = 28, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 939, monster_id = 21010601, pos = { x = 2019.8, y = 204.2, z = -843.9 }, rot = { x = 0.0, y = 223.4, z = 0.0 }, level = 28, drop_tag = "丘丘人", disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
