--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 254001, monster_id = 24010101, pos = { x = -171.0, y = 163.6, z = 903.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, drop_tag = "遗迹守卫", pose_id = 101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 254002, gadget_id = 70310001, pos = { x = -165.5, y = 164.8, z = 897.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 254003, gadget_id = 70310001, pos = { x = -171.0, y = 164.9, z = 897.1 }, rot = { x = 0.0, y = 179.6, z = 0.0 }, level = 32 },
	{ config_id = 254004, gadget_id = 70211131, pos = { x = -171.6, y = 170.4, z = 1014.2 }, rot = { x = 0.0, y = 180.7, z = 0.0 }, level = 32, drop_tag = "解谜超级璃月", isOneoff = true, persistent = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 254005, gadget_id = 70211131, pos = { x = -158.5, y = 171.2, z = 926.2 }, rot = { x = 0.0, y = 178.7, z = 0.0 }, level = 32, drop_tag = "解谜超级璃月", isOneoff = true, persistent = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 254001 },
		gadgets = { 254002, 254003, 254004, 254005 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
