--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 48002, monster_id = 25010202, pos = { x = -881.0, y = 217.0, z = 722.0 }, rot = { x = 0.0, y = 251.5, z = 0.0 }, level = 28, drop_tag = "盗宝团", disableWander = true },
	{ config_id = 48003, monster_id = 25010202, pos = { x = -883.1, y = 216.8, z = 723.8 }, rot = { x = 0.0, y = 198.6, z = 0.0 }, level = 28, drop_tag = "盗宝团", disableWander = true },
	{ config_id = 48004, monster_id = 25010202, pos = { x = -877.9, y = 216.6, z = 720.1 }, rot = { x = 0.0, y = 150.2, z = 0.0 }, level = 28, drop_tag = "盗宝团", disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 48001, gadget_id = 70211001, pos = { x = -882.6, y = 217.0, z = 722.0 }, rot = { x = 5.1, y = 1.4, z = 358.3 }, level = 32, drop_tag = "战斗低级璃月", isOneoff = true, persistent = true }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = suite_1,
		monsters = { 48002, 48003, 48004 },
		gadgets = { 48001 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
