--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 58, monster_id = 21010701, pos = { x = 2736.6, y = 248.2, z = 166.3 }, rot = { x = 0.0, y = 171.0, z = 0.0 }, level = 24, drop_tag = "丘丘人", disableWander = true },
	{ config_id = 59, monster_id = 21011001, pos = { x = 2735.9, y = 248.2, z = 162.7 }, rot = { x = 0.0, y = 126.6, z = 0.0 }, level = 22, drop_tag = "远程丘丘人", disableWander = true, pose_id = 32 },
	{ config_id = 116, monster_id = 21010201, pos = { x = 2746.7, y = 242.5, z = 162.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 22, drop_tag = "丘丘人", disableWander = true, pose_id = 9002 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 264, gadget_id = 70220020, pos = { x = 2731.8, y = 248.8, z = 169.7 }, rot = { x = 0.0, y = 331.4, z = 0.0 }, level = 23 },
	{ config_id = 265, gadget_id = 70220020, pos = { x = 2735.6, y = 248.9, z = 171.5 }, rot = { x = 0.0, y = 150.1, z = 0.0 }, level = 23 },
	{ config_id = 267, gadget_id = 70220020, pos = { x = 2732.7, y = 251.3, z = 175.5 }, rot = { x = 0.0, y = 324.7, z = 0.0 }, level = 23 },
	{ config_id = 654, gadget_id = 70310006, pos = { x = 2748.3, y = 242.5, z = 163.8 }, rot = { x = 0.0, y = 116.0, z = 0.0 }, level = 23 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 58, 59, 116 },
		gadgets = { 264, 265, 267, 654 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
