--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 143001, monster_id = 23020101, pos = { x = -154.2, y = 232.2, z = 1244.9 }, rot = { x = 0.0, y = 26.4, z = 0.0 }, level = 32, drop_tag = "债务处理人" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 143002, gadget_id = 70220013, pos = { x = -143.0, y = 230.2, z = 1254.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 143003, gadget_id = 70220014, pos = { x = -142.2, y = 230.7, z = 1263.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 143004, gadget_id = 70220014, pos = { x = -143.4, y = 230.6, z = 1263.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32 },
	{ config_id = 143005, gadget_id = 70310001, pos = { x = -156.7, y = 232.2, z = 1245.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 143006, gadget_id = 70310001, pos = { x = -186.9, y = 234.6, z = 1241.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 143007, gadget_id = 70310001, pos = { x = -194.9, y = 234.6, z = 1233.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, state = GadgetState.GearStart },
	{ config_id = 143008, gadget_id = 70310001, pos = { x = -172.9, y = 234.6, z = 1215.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 32, state = GadgetState.GearStart }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 143001 },
		gadgets = { 143002, 143003, 143004, 143005, 143006, 143007, 143008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
