--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 16001, monster_id = 28030101, pos = { x = -275.0, y = 201.9, z = 145.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 18, drop_tag = "鸟类" },
	{ config_id = 16002, monster_id = 28030101, pos = { x = -277.7, y = 201.0, z = 142.9 }, rot = { x = 0.0, y = 150.1, z = 0.0 }, level = 18, drop_tag = "鸟类" },
	{ config_id = 16003, monster_id = 28030101, pos = { x = -216.0, y = 275.2, z = 227.6 }, rot = { x = 0.0, y = 150.1, z = 0.0 }, level = 18, drop_tag = "鸟类" },
	{ config_id = 16004, monster_id = 28030101, pos = { x = -217.7, y = 274.8, z = 235.2 }, rot = { x = 0.0, y = 204.6, z = 0.0 }, level = 18, drop_tag = "鸟类" },
	{ config_id = 16005, monster_id = 28020102, pos = { x = -168.9, y = 279.7, z = 149.9 }, rot = { x = 0.0, y = 327.4, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16006, monster_id = 28020102, pos = { x = -258.4, y = 244.4, z = 44.3 }, rot = { x = 0.0, y = 327.4, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16007, monster_id = 28020201, pos = { x = -226.5, y = 268.7, z = 223.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16008, monster_id = 28020201, pos = { x = -245.0, y = 211.4, z = 148.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16009, monster_id = 28020201, pos = { x = -223.2, y = 234.9, z = 166.2 }, rot = { x = 0.0, y = 329.1, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16010, monster_id = 28020301, pos = { x = -242.3, y = 237.0, z = 117.3 }, rot = { x = 0.0, y = 110.6, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16011, monster_id = 28020301, pos = { x = -225.3, y = 240.0, z = 140.3 }, rot = { x = 0.0, y = 258.5, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16012, monster_id = 28030402, pos = { x = -221.3, y = 275.4, z = 59.4 }, rot = { x = 0.0, y = 150.1, z = 0.0 }, level = 18, drop_tag = "鸟类" },
	{ config_id = 16013, monster_id = 28030402, pos = { x = -220.4, y = 274.0, z = 54.6 }, rot = { x = 0.0, y = 150.1, z = 0.0 }, level = 18, drop_tag = "鸟类" },
	{ config_id = 16014, monster_id = 28020301, pos = { x = -181.0, y = 260.8, z = 10.1 }, rot = { x = 0.0, y = 110.6, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16015, monster_id = 28030402, pos = { x = -237.2, y = 244.2, z = 14.4 }, rot = { x = 0.0, y = 150.1, z = 0.0 }, level = 18, drop_tag = "鸟类" },
	{ config_id = 16016, monster_id = 28030402, pos = { x = -240.8, y = 243.8, z = 15.3 }, rot = { x = 0.0, y = 150.1, z = 0.0 }, level = 18, drop_tag = "鸟类" },
	{ config_id = 16017, monster_id = 28020301, pos = { x = -202.4, y = 308.2, z = 87.7 }, rot = { x = 0.0, y = 258.5, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16018, monster_id = 28030101, pos = { x = -236.0, y = 285.2, z = 85.6 }, rot = { x = 0.0, y = 204.6, z = 0.0 }, level = 18, drop_tag = "鸟类" },
	{ config_id = 16019, monster_id = 28030101, pos = { x = -234.8, y = 286.1, z = 80.9 }, rot = { x = 44.9, y = 281.4, z = 4.5 }, level = 18, drop_tag = "鸟类" },
	{ config_id = 16020, monster_id = 28020201, pos = { x = -210.4, y = 279.6, z = 123.2 }, rot = { x = 0.0, y = 70.4, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16021, monster_id = 28020201, pos = { x = -201.5, y = 283.0, z = 127.3 }, rot = { x = 0.0, y = 292.6, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16022, monster_id = 28020102, pos = { x = -222.6, y = 270.9, z = 192.5 }, rot = { x = 0.0, y = 175.0, z = 0.0 }, level = 18, drop_tag = "走兽" },
	{ config_id = 16023, monster_id = 28020301, pos = { x = -200.8, y = 292.4, z = 203.5 }, rot = { x = 0.0, y = 167.1, z = 0.0 }, level = 18, drop_tag = "走兽" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 16001, 16002, 16003, 16004, 16005, 16006, 16007, 16008, 16009, 16010, 16011, 16012, 16013, 16014, 16015, 16016, 16017, 16018, 16019, 16020, 16021, 16022, 16023 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
