--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 322, gadget_id = 70211101, pos = { x = 2645.7, y = 215.9, z = 445.2 }, rot = { x = 9.4, y = 266.5, z = 341.0 }, level = 23, drop_tag = "解谜低级蒙德", isOneoff = true, persistent = true },
	{ config_id = 892, gadget_id = 70211101, pos = { x = 2580.0, y = 198.4, z = 400.5 }, rot = { x = 0.0, y = 75.4, z = 355.8 }, level = 23, drop_tag = "解谜低级蒙德", isOneoff = true, persistent = true },
	{ config_id = 905, gadget_id = 70211101, pos = { x = 2630.3, y = 211.2, z = 463.1 }, rot = { x = 340.1, y = 130.5, z = 7.3 }, level = 23, drop_tag = "解谜低级蒙德", isOneoff = true, persistent = true },
	{ config_id = 906, gadget_id = 70211101, pos = { x = 2652.0, y = 220.3, z = 428.5 }, rot = { x = 350.3, y = 87.9, z = 7.7 }, level = 23, drop_tag = "解谜低级蒙德", isOneoff = true, persistent = true }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 322, 892, 905, 906 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
