--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 408001, monster_id = 28020201, pos = { x = 215.8, y = 194.9, z = 1402.8 }, rot = { x = 0.0, y = 266.4, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 408002, monster_id = 28020102, pos = { x = 216.4, y = 194.9, z = 1407.0 }, rot = { x = 0.0, y = 130.8, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 408003, monster_id = 28020201, pos = { x = 220.2, y = 194.8, z = 1407.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 408004, monster_id = 28020102, pos = { x = 218.4, y = 194.9, z = 1404.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 408005, monster_id = 28020201, pos = { x = 156.7, y = 212.7, z = 1131.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 408006, monster_id = 28020201, pos = { x = 233.7, y = 236.1, z = 1044.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 408007, monster_id = 28030402, pos = { x = 205.0, y = 233.6, z = 1064.6 }, rot = { x = 0.0, y = 339.8, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 408008, monster_id = 28030402, pos = { x = 204.7, y = 233.2, z = 1063.4 }, rot = { x = 0.0, y = 16.5, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 408009, monster_id = 28030402, pos = { x = 144.8, y = 220.0, z = 1122.1 }, rot = { x = 0.0, y = 342.9, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 408010, monster_id = 28030402, pos = { x = 143.7, y = 220.6, z = 1122.4 }, rot = { x = 0.0, y = 7.9, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 408011, monster_id = 28030402, pos = { x = 32.0, y = 214.1, z = 1224.4 }, rot = { x = 0.0, y = 6.2, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 408012, monster_id = 28030402, pos = { x = 30.9, y = 214.2, z = 1225.0 }, rot = { x = 0.0, y = 32.4, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 408013, monster_id = 28020102, pos = { x = 63.5, y = 203.1, z = 1212.3 }, rot = { x = 0.0, y = 26.7, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 408014, monster_id = 28020102, pos = { x = 52.2, y = 234.2, z = 1101.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 408015, monster_id = 28020102, pos = { x = 53.5, y = 234.2, z = 1102.1 }, rot = { x = 0.0, y = 292.8, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 408016, monster_id = 28020102, pos = { x = 25.2, y = 236.9, z = 1099.7 }, rot = { x = 0.0, y = 22.8, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 408017, monster_id = 28020102, pos = { x = 113.9, y = 230.1, z = 1066.3 }, rot = { x = 0.0, y = 26.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 408018, monster_id = 28020102, pos = { x = 202.4, y = 238.3, z = 1022.0 }, rot = { x = 0.0, y = 320.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 408019, monster_id = 28030101, pos = { x = 294.1, y = 230.7, z = 1626.6 }, rot = { x = 0.0, y = 110.4, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 408020, monster_id = 28030101, pos = { x = 296.4, y = 230.7, z = 1626.5 }, rot = { x = 0.0, y = 224.9, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 408021, monster_id = 28030101, pos = { x = 314.5, y = 231.0, z = 1652.0 }, rot = { x = 0.0, y = 82.7, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 408022, monster_id = 28030101, pos = { x = 409.1, y = 230.7, z = 1709.1 }, rot = { x = 0.0, y = 307.0, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 408023, monster_id = 28030101, pos = { x = 378.0, y = 230.7, z = 1685.1 }, rot = { x = 0.0, y = 330.5, z = 0.0 }, level = 24, drop_tag = "鸟类" },
	{ config_id = 408024, monster_id = 28020201, pos = { x = 43.9, y = 194.9, z = 1280.7 }, rot = { x = 0.0, y = 273.7, z = 0.0 }, level = 24, drop_tag = "走兽" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 408001, 408002, 408003, 408004, 408005, 408006, 408007, 408008, 408009, 408010, 408011, 408012, 408013, 408014, 408015, 408016, 408017, 408018, 408019, 408020, 408021, 408022, 408023, 408024 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
