--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 1213, monster_id = 20010501, pos = { x = 1278.1, y = 269.1, z = -1587.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 1214, monster_id = 20010501, pos = { x = 1295.5, y = 271.0, z = -1595.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "史莱姆" },
	{ config_id = 1215, monster_id = 20010501, pos = { x = 1308.6, y = 271.5, z = -1603.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "史莱姆" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3058, gadget_id = 70210101, pos = { x = 1225.5, y = 259.6, z = -1547.5 }, rot = { x = 0.0, y = 341.6, z = 0.0 }, level = 15, drop_tag = "搜刮点解谜通用蒙德", type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 3059, gadget_id = 70210101, pos = { x = 1218.8, y = 265.7, z = -1681.2 }, rot = { x = 0.0, y = 207.6, z = 0.0 }, level = 15, drop_tag = "搜刮点解谜通用蒙德", type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 3060, gadget_id = 70210101, pos = { x = 1428.7, y = 319.5, z = -1969.0 }, rot = { x = 0.0, y = 196.7, z = 0.0 }, level = 15, drop_tag = "搜刮点解谜通用蒙德", type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 1213, 1214, 1215 },
		gadgets = { 3058, 3059, 3060 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
