--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 255003, monster_id = 28010101, pos = { x = 280.2, y = 213.9, z = 204.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "采集动物" },
	{ config_id = 255004, monster_id = 28010101, pos = { x = 277.2, y = 213.9, z = 211.8 }, rot = { x = 0.0, y = 168.3, z = 0.0 }, level = 19, drop_tag = "采集动物" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 255001, gadget_id = 70211021, pos = { x = 280.5, y = 213.3, z = 213.0 }, rot = { x = 0.0, y = 352.8, z = 0.0 }, level = 19, drop_tag = "战斗高级璃月", isOneoff = true, persistent = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 255002, gadget_id = 70211021, pos = { x = 286.5, y = 213.4, z = 203.5 }, rot = { x = 0.0, y = 267.4, z = 0.0 }, level = 19, drop_tag = "战斗高级璃月", isOneoff = true, persistent = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 255003, 255004 },
		gadgets = { 255001, 255002 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
