--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 402001, monster_id = 28030501, pos = { x = 204.8, y = 185.3, z = 1352.4 }, rot = { x = 0.0, y = 87.5, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 402002, monster_id = 28030501, pos = { x = 204.6, y = 185.3, z = 1372.9 }, rot = { x = 0.0, y = 337.8, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 402003, monster_id = 28030501, pos = { x = 235.1, y = 185.3, z = 1362.5 }, rot = { x = 0.0, y = 342.6, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 402004, monster_id = 28030502, pos = { x = 191.8, y = 185.3, z = 1342.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 402005, monster_id = 28030502, pos = { x = 207.9, y = 185.3, z = 1331.2 }, rot = { x = 0.0, y = 32.7, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 402006, monster_id = 28030503, pos = { x = 220.0, y = 185.3, z = 1371.2 }, rot = { x = 0.0, y = 35.4, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 402007, monster_id = 28030503, pos = { x = 217.2, y = 185.3, z = 1345.7 }, rot = { x = 0.0, y = 287.8, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 402008, monster_id = 28030503, pos = { x = 188.3, y = 185.3, z = 1346.7 }, rot = { x = 0.0, y = 170.1, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 402009, monster_id = 28030503, pos = { x = 195.7, y = 185.3, z = 1303.7 }, rot = { x = 0.0, y = 151.7, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 901 },
	{ config_id = 402010, monster_id = 28030501, pos = { x = 266.1, y = 185.3, z = 1370.6 }, rot = { x = 0.0, y = 342.6, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 402011, monster_id = 28030501, pos = { x = 165.0, y = 185.3, z = 1369.7 }, rot = { x = 0.0, y = 337.8, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 402012, monster_id = 28030503, pos = { x = 161.4, y = 185.3, z = 1355.7 }, rot = { x = 0.0, y = 170.1, z = 0.0 }, level = 24, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 402013, monster_id = 28040101, pos = { x = 190.9, y = 184.2, z = 1367.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "水族" },
	{ config_id = 402014, monster_id = 28040101, pos = { x = 170.7, y = 184.2, z = 1350.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "水族" },
	{ config_id = 402015, monster_id = 28040101, pos = { x = 164.8, y = 184.2, z = 1373.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "水族" },
	{ config_id = 402016, monster_id = 28040101, pos = { x = 182.9, y = 184.2, z = 1331.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "水族" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 402001, 402002, 402003, 402004, 402005, 402006, 402007, 402008, 402009, 402010, 402011, 402012, 402013, 402014, 402015, 402016 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
