--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 326, monster_id = 28050101, pos = { x = 1877.8, y = 201.9, z = -1272.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 327, monster_id = 28050101, pos = { x = 1913.7, y = 201.9, z = -1254.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 328, monster_id = 28050101, pos = { x = 1953.8, y = 196.5, z = -1217.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 329, monster_id = 28050101, pos = { x = 1887.2, y = 204.7, z = -1251.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 330, monster_id = 28050101, pos = { x = 1898.8, y = 203.8, z = -1276.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 331, monster_id = 28050101, pos = { x = 1883.7, y = 211.5, z = -1274.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 336, monster_id = 28050101, pos = { x = 1983.0, y = 203.3, z = -1357.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 338, monster_id = 28050101, pos = { x = 1868.3, y = 199.2, z = -1156.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 340, monster_id = 28050101, pos = { x = 1796.6, y = 202.3, z = -1296.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1200, monster_id = 28050101, pos = { x = 1386.1, y = 270.8, z = -1670.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1201, monster_id = 28050101, pos = { x = 1388.6, y = 269.5, z = -1648.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1202, monster_id = 28050101, pos = { x = 1594.6, y = 269.6, z = -1484.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1203, monster_id = 28050101, pos = { x = 1521.1, y = 271.5, z = -1505.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1204, monster_id = 28050101, pos = { x = 1467.3, y = 270.9, z = -1527.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1205, monster_id = 28050101, pos = { x = 1454.4, y = 242.1, z = -1536.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1206, monster_id = 28050101, pos = { x = 1470.0, y = 272.1, z = -1792.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1207, monster_id = 28050101, pos = { x = 1439.9, y = 271.3, z = -1773.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1208, monster_id = 28050101, pos = { x = 1322.8, y = 282.5, z = -1780.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1209, monster_id = 28050101, pos = { x = 1334.6, y = 281.9, z = -1793.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1211, monster_id = 28050101, pos = { x = 1441.3, y = 281.1, z = -1840.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 1212, monster_id = 28050101, pos = { x = 1432.5, y = 273.6, z = -1789.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "魔法生物" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 326, 327, 328, 329, 330, 331, 336, 338, 340, 1200, 1201, 1202, 1203, 1204, 1205, 1206, 1207, 1208, 1209, 1211, 1212 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
