--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 418001, gadget_id = 70211103, pos = { x = 1715.9, y = 210.2, z = 828.9 }, rot = { x = 355.6, y = 277.1, z = 7.6 }, level = 1, drop_tag = "解谜低级璃月", state = GadgetState.ChestBramble, isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 418002, gadget_id = 70211103, pos = { x = 1728.4, y = 211.1, z = 855.7 }, rot = { x = 15.2, y = 165.4, z = 339.8 }, level = 18, drop_tag = "解谜低级璃月", state = GadgetState.ChestBramble, isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 418001, 418002 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
