--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 149001, monster_id = 28020201, pos = { x = 1342.9, y = 229.4, z = 1151.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 149002, monster_id = 28020201, pos = { x = 1356.8, y = 234.0, z = 1187.3 }, rot = { x = 0.0, y = 23.5, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 149003, monster_id = 28020102, pos = { x = 1333.2, y = 222.7, z = 1126.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 149004, monster_id = 28020102, pos = { x = 1341.9, y = 230.2, z = 1160.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 149005, monster_id = 28020201, pos = { x = 1351.3, y = 234.5, z = 1189.0 }, rot = { x = 0.0, y = 121.4, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 149006, monster_id = 28020201, pos = { x = 1351.2, y = 234.0, z = 1184.0 }, rot = { x = 0.0, y = 23.5, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 149007, monster_id = 28020301, pos = { x = 1358.8, y = 233.6, z = 1175.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 149008, monster_id = 28020301, pos = { x = 1334.9, y = 231.0, z = 1162.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 149009, monster_id = 28020102, pos = { x = 1349.9, y = 232.5, z = 1172.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 149010, monster_id = 28020102, pos = { x = 1361.2, y = 234.2, z = 1180.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "走兽" },
	{ config_id = 149011, monster_id = 28030401, pos = { x = 1348.2, y = 231.3, z = 1164.6 }, rot = { x = 0.0, y = 315.6, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 149012, monster_id = 28030401, pos = { x = 1343.8, y = 230.8, z = 1164.4 }, rot = { x = 0.0, y = 43.1, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 149013, monster_id = 28030401, pos = { x = 1353.3, y = 232.7, z = 1172.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 149014, monster_id = 28030401, pos = { x = 1357.0, y = 233.6, z = 1181.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 149015, monster_id = 28030401, pos = { x = 1331.4, y = 228.3, z = 1148.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 149016, monster_id = 28030401, pos = { x = 1331.3, y = 229.2, z = 1153.6 }, rot = { x = 0.0, y = 228.6, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 149017, monster_id = 28030401, pos = { x = 1328.6, y = 228.5, z = 1149.3 }, rot = { x = 0.0, y = 56.8, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 149018, monster_id = 28030401, pos = { x = 1357.4, y = 234.0, z = 1186.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 149019, monster_id = 28030401, pos = { x = 1358.1, y = 234.0, z = 1189.0 }, rot = { x = 1.9, y = 223.9, z = 1.8 }, level = 19, drop_tag = "鸟类" },
	{ config_id = 149020, monster_id = 28020301, pos = { x = 1358.4, y = 234.1, z = 1193.3 }, rot = { x = 0.0, y = 177.5, z = 0.0 }, level = 19, drop_tag = "走兽" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 149001, 149002, 149003, 149004, 149005, 149006, 149007, 149008, 149009, 149010, 149011, 149012, 149013, 149014, 149015, 149016, 149017, 149018, 149019, 149020 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
