--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 541, monster_id = 28030101, pos = { x = 1391.1, y = 234.4, z = -1516.7 }, rot = { x = 0.0, y = 302.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 542, monster_id = 28030101, pos = { x = 1370.4, y = 252.8, z = -1518.3 }, rot = { x = 0.0, y = 146.7, z = 0.0 }, level = 1, drop_tag = "鸟类" },
	{ config_id = 585, monster_id = 28030101, pos = { x = 1387.7, y = 233.8, z = -1510.3 }, rot = { x = 0.0, y = 216.4, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 634, monster_id = 28030101, pos = { x = 1382.7, y = 234.4, z = -1516.3 }, rot = { x = 0.0, y = 83.2, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 644, monster_id = 28020301, pos = { x = 1601.0, y = 246.8, z = -1632.4 }, rot = { x = 0.0, y = 244.7, z = 0.0 }, level = 1, drop_tag = "走兽" },
	{ config_id = 645, monster_id = 28030401, pos = { x = 1608.6, y = 249.0, z = -1619.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 647, monster_id = 28030401, pos = { x = 1619.3, y = 248.6, z = -1596.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 649, monster_id = 28030401, pos = { x = 1625.2, y = 249.3, z = -1614.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 },
	{ config_id = 650, monster_id = 28030401, pos = { x = 1615.7, y = 246.4, z = -1620.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, drop_tag = "鸟类", pose_id = 2 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 541, 542, 585, 634, 644, 650 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
