--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 2883, gadget_id = 70211121, pos = { x = 1211.7, y = 274.1, z = -1696.1 }, rot = { x = 0.0, y = 76.2, z = 0.0 }, level = 16, chest_drop_id = 1010600, drop_count = 1, isOneoff = true, persistent = true },
	{ config_id = 2884, gadget_id = 70211121, pos = { x = 1211.6, y = 274.1, z = -1696.2 }, rot = { x = 0.0, y = 78.4, z = 0.0 }, level = 15, drop_tag = "解谜高级蒙德", isOneoff = true, persistent = true }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 2884 },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = suite_2,
		monsters = { },
		gadgets = { 2883 },
		regions = { },
		triggers = { },
		rand_weight = 0,
		ban_refresh = true
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
