--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 409001, monster_id = 28010202, pos = { x = 204.8, y = 193.1, z = 1265.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409002, monster_id = 28010202, pos = { x = 180.2, y = 186.8, z = 1272.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409003, monster_id = 28010202, pos = { x = 183.7, y = 192.6, z = 1250.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409004, monster_id = 28010202, pos = { x = 161.9, y = 187.7, z = 1259.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409005, monster_id = 28010202, pos = { x = 158.1, y = 194.7, z = 1229.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409006, monster_id = 28010202, pos = { x = 143.2, y = 186.4, z = 1264.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409007, monster_id = 28010202, pos = { x = 153.6, y = 190.8, z = 1295.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409008, monster_id = 28010202, pos = { x = 165.9, y = 187.4, z = 1277.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409009, monster_id = 28020301, pos = { x = 103.4, y = 194.6, z = 1238.1 }, rot = { x = 0.0, y = 265.2, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 409010, monster_id = 28020301, pos = { x = 96.7, y = 191.9, z = 1249.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 409011, monster_id = 28020301, pos = { x = 89.8, y = 195.0, z = 1242.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 409012, monster_id = 28010201, pos = { x = 265.5, y = 244.7, z = 1059.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "采集动物" },
	{ config_id = 409013, monster_id = 28010201, pos = { x = 243.3, y = 243.3, z = 1067.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "采集动物" },
	{ config_id = 409014, monster_id = 28010201, pos = { x = 212.1, y = 238.1, z = 1092.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "采集动物" },
	{ config_id = 409015, monster_id = 28010201, pos = { x = 157.9, y = 233.0, z = 1060.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "采集动物" },
	{ config_id = 409016, monster_id = 28010201, pos = { x = 133.9, y = 223.1, z = 1112.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409017, monster_id = 28010201, pos = { x = 58.1, y = 232.2, z = 1127.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409018, monster_id = 28010201, pos = { x = 20.8, y = 238.1, z = 1106.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409019, monster_id = 28010201, pos = { x = 85.5, y = 221.0, z = 1164.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409020, monster_id = 28010201, pos = { x = 5.7, y = 230.3, z = 1183.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409021, monster_id = 28010201, pos = { x = 37.3, y = 225.2, z = 1159.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "采集动物" },
	{ config_id = 409022, monster_id = 28020301, pos = { x = 49.3, y = 202.0, z = 1230.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 409023, monster_id = 28020301, pos = { x = 85.1, y = 229.7, z = 1093.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, drop_tag = "走兽" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 409001, 409002, 409003, 409004, 409005, 409006, 409007, 409008, 409009, 409010, 409011, 409012, 409013, 409014, 409015, 409016, 409017, 409018, 409019, 409020, 409021, 409022, 409023 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
