--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 247, monster_id = 21010101, pos = { x = 693.2, y = 215.9, z = -245.7 }, rot = { x = 0.0, y = 208.1, z = 0.0 }, level = 22, drop_tag = "丘丘人", pose_id = 9010 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 250, gadget_id = 70220024, pos = { x = 687.8, y = 215.2, z = -246.0 }, rot = { x = 0.4, y = 261.2, z = 0.0 }, level = 25, isOneoff = true },
	{ config_id = 251, gadget_id = 70211111, pos = { x = 681.0, y = 216.7, z = -248.0 }, rot = { x = 0.0, y = 93.9, z = 0.0 }, level = 25, drop_tag = "解谜中级璃月", isOneoff = true, persistent = true, type = GadgetType.GADGET_WORLD_CHECT },
	{ config_id = 389, gadget_id = 70220035, pos = { x = 692.9, y = 215.9, z = -246.7 }, rot = { x = 346.6, y = 43.4, z = 352.3 }, level = 25 },
	{ config_id = 104001, gadget_id = 70220024, pos = { x = 663.5, y = 247.5, z = -414.6 }, rot = { x = 0.4, y = 261.2, z = 0.0 }, level = 25, isOneoff = true },
	{ config_id = 104002, gadget_id = 70220024, pos = { x = 679.7, y = 249.3, z = -402.3 }, rot = { x = 0.4, y = 261.2, z = 0.0 }, level = 25, isOneoff = true }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 247 },
		gadgets = { 250, 251, 389, 104001, 104002 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
