--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 17002, monster_id = 21010901, pos = { x = 1416.2, y = 201.9, z = 374.1 }, rot = { x = 0.0, y = 94.7, z = 0.0 }, level = 16, drop_tag = "远程丘丘人", disableWander = true },
	{ config_id = 17003, monster_id = 21010901, pos = { x = 1432.3, y = 201.2, z = 388.3 }, rot = { x = 0.0, y = 176.5, z = 0.0 }, level = 16, drop_tag = "远程丘丘人", disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 17001, gadget_id = 70211104, pos = { x = 1404.9, y = 199.8, z = 365.6 }, rot = { x = 355.3, y = 0.0, z = 0.0 }, level = 16, drop_tag = "解谜低级璃月", state = GadgetState.ChestFrozen, isOneoff = true, type = GadgetType.GADGET_WORLD_CHECT }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 17002, 17003 },
		gadgets = { 17001 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
