--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 427, monster_id = 22010301, pos = { x = 2530.4, y = 205.3, z = 216.4 }, rot = { x = 0.0, y = 58.3, z = 0.0 }, level = 1, drop_tag = "深渊法师", affix = { 1401 }, isElite = true },
	{ config_id = 428, monster_id = 21010301, pos = { x = 2536.4, y = 205.8, z = 216.8 }, rot = { x = 0.0, y = 253.2, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 429, monster_id = 21010201, pos = { x = 2536.2, y = 205.6, z = 220.2 }, rot = { x = 0.0, y = 235.5, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 430, monster_id = 21010201, pos = { x = 2532.8, y = 205.6, z = 220.8 }, rot = { x = 0.0, y = 223.4, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true },
	{ config_id = 431, monster_id = 21010601, pos = { x = 2534.2, y = 205.8, z = 214.3 }, rot = { x = 0.0, y = 359.9, z = 0.0 }, level = 1, drop_tag = "丘丘人", affix = { 1401, 1408 }, isElite = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 982, gadget_id = 70300107, pos = { x = 2533.1, y = 205.6, z = 218.3 }, rot = { x = 0.0, y = 323.7, z = 0.0 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 983, gadget_id = 70220013, pos = { x = 2536.6, y = 206.0, z = 212.2 }, rot = { x = 0.0, y = 71.3, z = 0.0 }, level = 1 },
	{ config_id = 984, gadget_id = 70220013, pos = { x = 2541.9, y = 206.1, z = 214.8 }, rot = { x = 0.0, y = 329.2, z = 0.0 }, level = 1 },
	{ config_id = 1038, gadget_id = 70220014, pos = { x = 2543.5, y = 205.8, z = 217.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 1039, gadget_id = 70220014, pos = { x = 2544.5, y = 205.7, z = 217.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = suite_1,
		monsters = { 427, 428, 429, 430, 431 },
		gadgets = { 982, 983, 984, 1038, 1039 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
