--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 963, monster_id = 21010501, pos = { x = 2735.6, y = 271.1, z = -1432.3 }, rot = { x = 0.0, y = 26.1, z = 0.0 }, level = 19, drop_tag = "远程丘丘人", disableWander = true },
	{ config_id = 964, monster_id = 21010501, pos = { x = 2738.7, y = 270.7, z = -1434.1 }, rot = { x = 0.0, y = 27.5, z = 0.0 }, level = 19, drop_tag = "远程丘丘人", disableWander = true },
	{ config_id = 965, monster_id = 21010901, pos = { x = 2730.2, y = 271.3, z = -1426.1 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, drop_tag = "远程丘丘人" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3159, gadget_id = 70220017, pos = { x = 2732.5, y = 270.7, z = -1440.4 }, rot = { x = 356.7, y = 247.7, z = 6.8 }, level = 30 },
	{ config_id = 3160, gadget_id = 70220013, pos = { x = 2732.2, y = 271.6, z = -1434.2 }, rot = { x = 0.0, y = 215.5, z = 13.3 }, level = 30 },
	{ config_id = 3161, gadget_id = 70220013, pos = { x = 2732.4, y = 271.1, z = -1437.7 }, rot = { x = 348.2, y = 326.0, z = 358.8 }, level = 30 },
	{ config_id = 3162, gadget_id = 70211001, pos = { x = 2731.3, y = 271.7, z = -1436.3 }, rot = { x = 0.0, y = 343.7, z = 0.0 }, level = 30, drop_tag = "战斗低级蒙德", isOneoff = true },
	{ config_id = 3428, gadget_id = 70310004, pos = { x = 2706.1, y = 244.6, z = -1154.7 }, rot = { x = 0.0, y = 334.8, z = 0.0 }, level = 30, state = GadgetState.GearStart }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 963, 964, 965 },
		gadgets = { 3159, 3160, 3161, 3162, 3428 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
