--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 23001, gadget_id = 70500000, pos = { x = -753.5, y = 220.6, z = 509.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, point_type = 4002, isOneoff = true },
	{ config_id = 23002, gadget_id = 70500000, pos = { x = -677.8, y = 285.0, z = 549.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, point_type = 4002, isOneoff = true },
	{ config_id = 23003, gadget_id = 70500000, pos = { x = -515.2, y = 367.0, z = 614.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, point_type = 4002, isOneoff = true },
	{ config_id = 23004, gadget_id = 70500000, pos = { x = -407.4, y = 424.9, z = 590.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, point_type = 4002, isOneoff = true },
	{ config_id = 23005, gadget_id = 70500000, pos = { x = -172.9, y = 509.8, z = 335.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 19, point_type = 4002, isOneoff = true },
	{ config_id = 23006, gadget_id = 70500000, pos = { x = -215.5, y = 428.9, z = 464.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, point_type = 4002, isOneoff = true },
	{ config_id = 23007, gadget_id = 70500000, pos = { x = -428.7, y = 276.0, z = 639.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 24, point_type = 4002, isOneoff = true }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 23001, 23002, 23003, 23004, 23005, 23006, 23007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
