--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 4, gadget_id = 70690003, pos = { x = 2563.1, y = 216.0, z = 321.3 }, rot = { x = 0.0, y = 343.7, z = 0.0 }, level = 23 },
	{ config_id = 5, gadget_id = 70690003, pos = { x = 2562.6, y = 217.9, z = 338.7 }, rot = { x = 0.0, y = 357.4, z = 0.0 }, level = 23 },
	{ config_id = 6, gadget_id = 70690003, pos = { x = 2552.4, y = 218.9, z = 368.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 23 },
	{ config_id = 35, gadget_id = 70690001, pos = { x = 2848.0, y = 256.4, z = 88.4 }, rot = { x = 0.0, y = 265.0, z = 0.0 }, level = 23 },
	{ config_id = 36, gadget_id = 70690001, pos = { x = 2900.4, y = 256.8, z = 60.8 }, rot = { x = 0.0, y = 136.7, z = 0.0 }, level = 23 },
	{ config_id = 37, gadget_id = 70690003, pos = { x = 2885.5, y = 239.5, z = 91.1 }, rot = { x = 0.0, y = 37.4, z = 0.0 }, level = 23 },
	{ config_id = 68, gadget_id = 70690003, pos = { x = 2675.2, y = 298.4, z = 161.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 23 },
	{ config_id = 69, gadget_id = 70690001, pos = { x = 2647.5, y = 310.8, z = 148.7 }, rot = { x = 0.0, y = 163.3, z = 0.0 }, level = 23 },
	{ config_id = 70, gadget_id = 70690003, pos = { x = 2658.8, y = 227.2, z = 415.9 }, rot = { x = 0.0, y = 2.1, z = 0.0 }, level = 23 },
	{ config_id = 71, gadget_id = 70690003, pos = { x = 2566.2, y = 231.9, z = 183.1 }, rot = { x = 0.0, y = 230.4, z = 0.0 }, level = 23 },
	{ config_id = 72, gadget_id = 70690003, pos = { x = 2585.9, y = 232.0, z = 54.0 }, rot = { x = 0.0, y = 4.7, z = 0.0 }, level = 23 },
	{ config_id = 73, gadget_id = 70690003, pos = { x = 2621.7, y = 254.0, z = 35.8 }, rot = { x = 0.0, y = 352.8, z = 0.0 }, level = 23 },
	{ config_id = 74, gadget_id = 70690003, pos = { x = 2710.8, y = 254.0, z = 34.8 }, rot = { x = 0.0, y = 314.9, z = 0.0 }, level = 23 },
	{ config_id = 75, gadget_id = 70690003, pos = { x = 2729.1, y = 239.3, z = 78.0 }, rot = { x = 0.0, y = 140.5, z = 0.0 }, level = 23 },
	{ config_id = 76, gadget_id = 70690003, pos = { x = 2740.8, y = 254.0, z = 120.3 }, rot = { x = 0.0, y = 73.0, z = 0.0 }, level = 23 },
	{ config_id = 77, gadget_id = 70690003, pos = { x = 2760.4, y = 254.0, z = 145.1 }, rot = { x = 0.0, y = 46.7, z = 0.0 }, level = 23 },
	{ config_id = 78, gadget_id = 70690003, pos = { x = 2746.9, y = 248.0, z = 186.8 }, rot = { x = 0.0, y = 200.8, z = 0.0 }, level = 23 },
	{ config_id = 79, gadget_id = 70690003, pos = { x = 2724.2, y = 240.3, z = 229.3 }, rot = { x = 0.0, y = 235.2, z = 0.0 }, level = 23 },
	{ config_id = 80, gadget_id = 70690003, pos = { x = 2663.1, y = 240.4, z = 252.3 }, rot = { x = 0.0, y = 146.4, z = 0.0 }, level = 23 },
	{ config_id = 81, gadget_id = 70690003, pos = { x = 2617.9, y = 227.1, z = 244.5 }, rot = { x = 0.0, y = 281.7, z = 0.0 }, level = 23 },
	{ config_id = 82, gadget_id = 70690003, pos = { x = 2576.1, y = 256.8, z = 208.3 }, rot = { x = 0.0, y = 353.1, z = 0.0 }, level = 23 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
