--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 807001, monster_id = 28020102, pos = { x = 955.7, y = 260.2, z = 1588.4 }, rot = { x = 0.0, y = 260.9, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807002, monster_id = 28020102, pos = { x = 808.2, y = 326.4, z = 1525.1 }, rot = { x = 0.0, y = 54.4, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807003, monster_id = 28020102, pos = { x = 640.1, y = 242.0, z = 1562.6 }, rot = { x = 0.0, y = 46.8, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807004, monster_id = 28020102, pos = { x = 616.9, y = 236.9, z = 1761.9 }, rot = { x = 0.0, y = 9.6, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807005, monster_id = 28020102, pos = { x = 1088.0, y = 280.1, z = 1328.6 }, rot = { x = 0.0, y = 137.9, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807006, monster_id = 28020102, pos = { x = 797.6, y = 268.6, z = 1347.9 }, rot = { x = 0.0, y = 89.9, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807007, monster_id = 28020102, pos = { x = 767.9, y = 321.6, z = 1807.8 }, rot = { x = 0.0, y = 29.4, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807009, monster_id = 28020102, pos = { x = 531.2, y = 349.6, z = 1339.1 }, rot = { x = 0.0, y = 285.0, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807010, monster_id = 28020102, pos = { x = 498.7, y = 331.2, z = 1872.1 }, rot = { x = 0.0, y = 49.3, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807011, monster_id = 28020102, pos = { x = 965.2, y = 336.1, z = 1422.8 }, rot = { x = 0.0, y = 175.1, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807012, monster_id = 28020102, pos = { x = 1066.2, y = 268.8, z = 1717.8 }, rot = { x = 0.0, y = 102.9, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807013, monster_id = 28020102, pos = { x = 494.8, y = 298.7, z = 1619.8 }, rot = { x = 0.0, y = 180.3, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807014, monster_id = 28020102, pos = { x = 651.1, y = 369.8, z = 1915.7 }, rot = { x = 0.0, y = 291.4, z = 0.0 }, level = 24, drop_tag = "走兽" },
	{ config_id = 807015, monster_id = 28020102, pos = { x = 1090.0, y = 349.7, z = 1515.6 }, rot = { x = 0.0, y = 29.7, z = 0.0 }, level = 24, drop_tag = "走兽" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 807001, 807002, 807003, 807004, 807005, 807006, 807007, 807009, 807010, 807011, 807012, 807013, 807014, 807015 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
