-- 所有的group
groups = {
	{ id = 220005001, refresh_id = 1001, pos = { x = -7.8, y = 4.3, z = 1.2 } },
	{ id = 220005002, refresh_id = 1002, pos = { x = -51.3, y = 4.3, z = 1.4 } },
	{ id = 220005003, refresh_id = 1, pos = { x = -114.1, y = 22.0, z = 42.3 } },
	{ id = 220005004, refresh_id = 999999, pos = { x = -155.1, y = 22.0, z = 42.8 } },
	{ id = 220005005, refresh_id = 1001, pos = { x = -174.2, y = 22.0, z = 41.4 } },
	{ id = 220005006, refresh_id = 1001, pos = { x = -190.6, y = 25.8, z = 124.3 } },
	{ id = 220005008, refresh_id = 999999, pos = { x = -209.4, y = 25.8, z = 156.5 } },
	{ id = 220005009, refresh_id = 1001, pos = { x = -289.1, y = 33.1, z = 168.4 } },
	{ id = 220005010, refresh_id = 1, pos = { x = -230.6, y = 25.1, z = 172.6 } },
	{ id = 220005011, refresh_id = 1, pos = { x = -282.8, y = 31.5, z = 177.2 } }
}
