-- 所有的group
groups = {
	{ id = 220024001, refresh_id = 1002, pos = { x = 64.5, y = 39.9, z = 120.9 } },
	{ id = 220024002, refresh_id = 1, pos = { x = 190.7, y = 42.0, z = 127.3 } },
	{ id = 220024003, refresh_id = 1002, pos = { x = 190.5, y = 49.9, z = 189.1 } },
	{ id = 220024005, refresh_id = 1002, pos = { x = 191.4, y = 57.0, z = 377.1 } },
	{ id = 220024006, refresh_id = 1, pos = { x = 71.0, y = 39.5, z = 121.3 } },
	{ id = 220024007, refresh_id = 1, pos = { x = 75.6, y = 39.5, z = 120.7 } },
	{ id = 220024008, refresh_id = 1, pos = { x = 190.7, y = 57.0, z = 332.6 } },
	{ id = 220024009, pos = { x = 192.7, y = 58.5, z = 343.7 } }
}
