-- 所有的group
groups = {
	{ id = 250014001, refresh_id = 1001, pos = { x = 59.3, y = 0.8, z = -80.0 } },
	{ id = 250014002, refresh_id = 1001, pos = { x = 57.6, y = 0.8, z = -0.1 } },
	{ id = 250014003, refresh_id = 1002, pos = { x = 21.7, y = 0.8, z = -80.2 } },
	{ id = 250014004, refresh_id = 1001, pos = { x = 20.6, y = 0.8, z = 0.0 } },
	{ id = 250014005, refresh_id = 1002, pos = { x = -16.4, y = 0.8, z = -79.2 } },
	{ id = 250014006, pos = { x = -18.6, y = 0.8, z = -0.2 } },
	{ id = 250014007, refresh_id = 1001, pos = { x = -16.0, y = 0.8, z = -70.6 } }
}
