-- 所有的group
groups = {
	{ id = 250006001, refresh_id = 1, pos = { x = 343.2, y = -28.9, z = 472.9 } },
	{ id = 250006002, refresh_id = 1, pos = { x = 343.2, y = -29.0, z = 430.0 } },
	{ id = 250006003, refresh_id = 1002, pos = { x = 342.9, y = -28.9, z = 425.9 } },
	{ id = 250006004, refresh_id = 1, pos = { x = 343.3, y = -19.3, z = 348.3 } },
	{ id = 250006005, refresh_id = 1002, pos = { x = 343.3, y = -19.3, z = 340.3 } },
	{ id = 250006006, refresh_id = 1, pos = { x = 343.3, y = -12.7, z = 265.5 } },
	{ id = 250006007, refresh_id = 1001, pos = { x = 343.3, y = -12.7, z = 260.7 } },
	{ id = 250006008, refresh_id = 1001, pos = { x = 341.3, y = -12.7, z = 261.8 } },
	{ id = 250006009, refresh_id = 1, pos = { x = 329.4, y = -11.9, z = 265.8 } }
}
