-- 所有的group
groups = {
	{ id = 220014002, refresh_id = 1, pos = { x = 191.8, y = 57.0, z = 332.1 } },
	{ id = 220014003, refresh_id = 1001, pos = { x = 172.0, y = 57.0, z = 338.2 } },
	{ id = 220014004, refresh_id = 1001, pos = { x = 215.0, y = 57.0, z = 338.4 } },
	{ id = 220014005, refresh_id = 1001, pos = { x = 191.5, y = 57.0, z = 377.0 } },
	{ id = 220014006, refresh_id = 1001, pos = { x = 191.6, y = 57.0, z = 376.5 } },
	{ id = 220014007, refresh_id = 1002, pos = { x = 191.5, y = 57.0, z = 376.1 } },
	{ id = 220014008, refresh_id = 1002, pos = { x = 192.2, y = 57.0, z = 376.8 } }
}
