-- 所有的group
groups = {
	{ id = 201016001, pos = { x = 345.3, y = 12.6, z = -2.8 } },
	{ id = 201016002, refresh_id = 1001, pos = { x = 160.7, y = 4.6, z = -48.8 } },
	{ id = 201016003, refresh_id = 1, pos = { x = 199.2, y = 4.6, z = -46.3 } },
	{ id = 201016004, refresh_id = 1, pos = { x = 207.3, y = 3.4, z = -29.3 } },
	{ id = 201016005, refresh_id = 1001, pos = { x = -31.7, y = 11.6, z = 4.3 } },
	{ id = 201016006, refresh_id = 1, pos = { x = 149.1, y = 31.9, z = -27.1 } },
	{ id = 201016007, refresh_id = 1001, pos = { x = 292.3, y = 1.1, z = -15.3 } },
	{ id = 201016008, refresh_id = 1001, pos = { x = 142.4, y = 33.9, z = 0.7 } }
}
