--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 618, gadget_id = 70900281, pos = { x = -370.4, y = -11.0, z = 524.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 619, gadget_id = 70900281, pos = { x = -370.4, y = -10.0, z = 524.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 620, gadget_id = 70900281, pos = { x = -370.4, y = -9.0, z = 524.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 621, gadget_id = 70900281, pos = { x = -370.4, y = -8.0, z = 524.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 622, gadget_id = 70900281, pos = { x = -370.4, y = -7.0, z = 524.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 623, gadget_id = 70900281, pos = { x = -371.4, y = -11.0, z = 522.9 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 1 },
	{ config_id = 624, gadget_id = 70900281, pos = { x = -371.4, y = -10.0, z = 522.9 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 1 },
	{ config_id = 625, gadget_id = 70900281, pos = { x = -371.4, y = -9.0, z = 522.9 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 1 },
	{ config_id = 626, gadget_id = 70900281, pos = { x = -371.4, y = -8.0, z = 522.9 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 1 },
	{ config_id = 627, gadget_id = 70900281, pos = { x = -371.4, y = -7.0, z = 522.9 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 1 },
	{ config_id = 628, gadget_id = 70900281, pos = { x = -376.4, y = -11.0, z = 523.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 629, gadget_id = 70900281, pos = { x = -376.4, y = -10.0, z = 523.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 630, gadget_id = 70900281, pos = { x = -376.4, y = -9.0, z = 523.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 631, gadget_id = 70900281, pos = { x = -376.4, y = -8.0, z = 523.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 632, gadget_id = 70900281, pos = { x = -376.4, y = -7.0, z = 523.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 633, gadget_id = 70900281, pos = { x = -375.4, y = -11.0, z = 528.9 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 1 },
	{ config_id = 634, gadget_id = 70900281, pos = { x = -375.4, y = -10.0, z = 528.9 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 1 },
	{ config_id = 635, gadget_id = 70900281, pos = { x = -375.4, y = -9.0, z = 528.9 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 1 },
	{ config_id = 636, gadget_id = 70900281, pos = { x = -375.4, y = -8.0, z = 528.9 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 1 },
	{ config_id = 637, gadget_id = 70900281, pos = { x = -375.4, y = -7.0, z = 528.9 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 1 },
	{ config_id = 638, gadget_id = 70900281, pos = { x = -371.4, y = -3.4, z = 526.1 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 1 },
	{ config_id = 639, gadget_id = 70900281, pos = { x = -371.4, y = -2.4, z = 526.1 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 1 },
	{ config_id = 640, gadget_id = 70900281, pos = { x = -371.4, y = -1.4, z = 526.1 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 1 },
	{ config_id = 641, gadget_id = 70900281, pos = { x = -371.4, y = -0.4, z = 526.1 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 1 },
	{ config_id = 642, gadget_id = 70900281, pos = { x = -371.4, y = 0.6, z = 526.1 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 1 },
	{ config_id = 643, gadget_id = 70211001, pos = { x = -373.5, y = 1.9, z = 524.1 }, rot = { x = 0.0, y = 182.3, z = 0.0 }, level = 1, drop_tag = "战斗低级蒙德", type = GadgetType.GADGET_DUNGEON_SECRET_CHEST }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 618, 619, 620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
