--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 35, monster_id = 20010601, pos = { x = -110.0, y = 4.0, z = -22.1 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 36, monster_id = 21010201, pos = { x = -112.6, y = 4.0, z = -25.8 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 37, monster_id = 21010201, pos = { x = -108.5, y = 4.0, z = -17.4 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 38, monster_id = 21010201, pos = { x = -105.7, y = 4.0, z = -22.3 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 39, monster_id = 21010201, pos = { x = -115.9, y = 4.0, z = -20.2 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 35, 36, 37, 38, 39 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
