--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 5, monster_id = 21010701, pos = { x = 136.0, y = 4.0, z = -106.6 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 6, monster_id = 21010701, pos = { x = 133.4, y = 4.0, z = -110.3 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 7, monster_id = 21011001, pos = { x = 137.5, y = 4.0, z = -101.9 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 8, monster_id = 21030301, pos = { x = 140.3, y = 4.0, z = -106.8 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 9, monster_id = 21010301, pos = { x = 130.1, y = 4.0, z = -104.7 }, rot = { x = 0.0, y = 282.8, z = 0.0 }, level = 20, disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 5, 6, 7, 8, 9 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
