--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 30, monster_id = 20011301, pos = { x = -45.1, y = 4.0, z = -21.3 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 31, monster_id = 21010201, pos = { x = -47.7, y = 4.0, z = -25.1 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 32, monster_id = 21010201, pos = { x = -43.6, y = 4.0, z = -16.6 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 33, monster_id = 21010201, pos = { x = -40.8, y = 4.0, z = -21.5 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 34, monster_id = 21010201, pos = { x = -51.0, y = 4.0, z = -19.4 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 30, 31, 32, 33, 34 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
