--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 25, monster_id = 20010901, pos = { x = 18.8, y = 4.0, z = -20.3 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 26, monster_id = 20011001, pos = { x = 16.1, y = 4.0, z = -24.0 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 27, monster_id = 20011001, pos = { x = 20.3, y = 4.0, z = -15.6 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 28, monster_id = 20011001, pos = { x = 23.1, y = 4.0, z = -20.5 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true },
	{ config_id = 29, monster_id = 20011001, pos = { x = 12.8, y = 4.0, z = -18.4 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 20, disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 25, 26, 27, 28, 29 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
