-- 所有的group
groups = {
	{ id = 250005001, refresh_id = 1001, pos = { x = 130.3, y = 4.0, z = -149.1 } },
	{ id = 250005002, refresh_id = 1001, pos = { x = 135.3, y = 4.0, z = -104.9 } },
	{ id = 250005003, refresh_id = 1002, pos = { x = 127.0, y = 4.0, z = -63.8 } },
	{ id = 250005004, refresh_id = 1002, pos = { x = 137.2, y = 4.0, z = -19.0 } },
	{ id = 250005005, refresh_id = 1001, pos = { x = 22.0, y = 4.0, z = -150.8 } },
	{ id = 250005006, refresh_id = 1002, pos = { x = 17.8, y = 4.0, z = -107.9 } },
	{ id = 250005007, refresh_id = 1002, pos = { x = 19.0, y = 4.0, z = -65.4 } },
	{ id = 250005008, refresh_id = 1001, pos = { x = 18.0, y = 4.0, z = -18.6 } },
	{ id = 250005009, refresh_id = 1001, pos = { x = -45.8, y = 4.0, z = -19.6 } },
	{ id = 250005010, refresh_id = 1001, pos = { x = -110.7, y = 4.0, z = -20.4 } }
}
